[
{"category": "inclusion", "article_link": "/newsarticle/37580/first-boulevard-raises-5m-for-black-community-focused-neobank", "title": "First Boulevard raises $5m for Black community-focused neobank", "datetime": "2021-03-02 03:20:51", "image": "/finextra-images/top_pics/xl/firstboulevardfounders.jpg", "desc": "First Boulevard, a neobank focused on the Black community, has raised $5 million in a seed funding round joined by Barclays.Anthemis and angels such as Gabrielle Union, John Buttrick and Jamere Jackson joined the round for First Boulevard, which has set itself the goal of helping Black America build generational wealth. First Boulevard is one of several digital banks - including Tenth and Greenwood - that have emerged in recent months as The Black Lives Matter movement has led to a renewed focus on America's wealth gap and the financial services industry's role in it. Founded by serial entrepreneurs Donald Hawkins and Asya Bradley, the startup is building a platform that offers fee-free debit cards, financial education, a Black business marketplace which gives its members cashback for buying Black, and technology to help members automate their saving and wealth building goals. First Boulevard is a Visa Fintech Fast Track partner and was recently unveiled as the payment giant's partner for the first pilot of its new suite of crypto APIs, which will enable customers to purchase, custody and trade digital assets. Says Hawkins: \"History has proven that oppressed communities can succeed when their finances are centralized, and when it comes to financial services for the Black community, a centralizing force is long overdue. \"After viewing yet another tragedy engulf the Black community, and the all-too-familiar protests against persisting issues, it was beyond clear to me that the solutions Black America needs must be financially-focused and developed within our community.\"", "source": "Finextra"},
{"category": "retail", "article_link": "/newsarticle/37575/bank-of-ireland-to-close-a-third-of-branch-network", "title": "Bank of Ireland to close a third of branch network", "datetime": "2021-03-01 19:20:52", "image": "/finextra-images/top_pics/xl/bank-of-ireland-3.jpg", "desc": "The Bank of Ireland is to shut a third of its branches as it reaches a digital \"tipping point\" between online and offline transactions.The bank is to shutter 88 outlets in the Republic, reducing its network from 257 to 169, while in Northern Ireland the network will be reduced by 15 from 28 to 13. The move is expected to generate €26 billion in annualised cost savings. Francesca McDonagh, Bank of Ireland CEO, says: For many years, the trend to digital banking has been evident, with customers using branches less and less. Covid-19 has accelerated this changing behaviour, and we’ve seen a seismic shift towards digital banking over the past 12 months. We’ve now reached a tipping point in customer preferences between online and offline banking.\" She says 70% of customers are now digitally active, with a 26% increase in customers registering for the new mobile app since launch. The branch closure programme comes as part of a new three-year strategy to trim costs by €1.5 billion, entailing a reduction in 1400 full time roles achieved through voluntary redundancies. Up to 200 jobs will be impacted by the branch takedowns, which will mostly hit umanned outlets.", "source": "Finextra"},
{"category": "regulation", "article_link": "/newsarticle/37571/regulators-make-inquiries-over-robinhood-trading-restrictions", "title": "Regulators make inquiries over Robinhood trading restrictions", "datetime": "2021-02-26 00:00:00", "image": "/finextra-images/top_pics/xl/robinhood-for-web.png", "desc": "US regulators have made inquiries to Robinhood about the trading restrictions the app put on stocks such as GameStop during the Reddit-led rallies earlier this year.Robinhood temporarily stopped users from buying dozens of stocks that day traders who use the WallStreetBets subreddit had targeted in a short squeeze assault. In a regulatory filing, the firm says it has received \"inquiries\" about its actions from the SEC, Finra, a number of state attorneys general offices and several state securities regulators. Meanwhile, Robinhood says it is aware of around 46 putative class actions and three individual actions that have been filed against it. \"The complaints generally allege breach of contract, breach of the implied covenant of good faith and fair dealing, negligence, breach of fiduciary duty and other common law claims,\" says the filing, adding: \"We believe that the claims in these lawsuits are without merit and intend to defend against them vigorously.\"", "source": "Finextra"},
{"category": "sustainable", "article_link": "/newsarticle/37573/fintechs-role-in-paris-agreement-success-and-restoration-of-nature-at-scale", "title": "Fintech’s role in Paris Agreement success and restoration of nature at scale", "datetime": "2021-03-02 16:00:53", "image": "/finextra-images/top_pics/xl/sustainable-3.jpg", "desc": "According to the UNFCCC High-Level Climate Champions and the Marrakech Partnership Climate Action Pathways report published at the end of 2020, certain notable breakthroughs are moving key sectors closer to the 2050 zero emissions goal, in an attempt to avert the impact of climate change. The report outlines the milestones required for limiting the global temperature rise to 1.5°C as per the 2015 Paris Agreement in the areas of energy, cities and other human settlements, industry, land use, oceans and coastal zones, transport, water and resilience.  In turn, this will provide a blueprint to coordinate climate ambition among cities, regions, businesses and investors in the run up to the UN Climate Change Conference in Glasgow in November 2021.  With a view that the restoration of nature at scale is crucial for the success of the goals highlighted in the Paris Agreement, emerging fintech Cultivo plans to deploy $1 billion into restoring at least 3.5 million hectares of land within the next five years, calling upon investors to utilise nature to protect biodiversity and capture CO2.  Dr Manuel Pinuela, co-founder and CEO of Cultivo, highlights how “nature-based solutions can provide at least 30% of the CO2 mitigation goals by 2030, yet receive only around 3% of the funding allocated to carbon capture.”  As a result, the fintech firm is on a mission to fill this “financing gap”, pushing the importance of natural restoration, carbon sequestration, and biodiversity protection.  Cultivo does this with “an innovative financing mechanism that connects financial institutions to NGOs and landowners in order to unlock investment into natural capital opportunities that restore nature, protect livelihoods, and deliver healthy financial returns to investors.”  The fintech uses proprietary algorithms and remote sensor technologies to identify high quality projects and forecast the natural capital returns, pooling investment products and providing financial institutions with a simple way to invest in sustainable projects, such as regenerative grazing or planting trees.  These generate carbon credits and other offsets that can be sold, providing a return to investors and a long-term reliable income stream to the landowners and local communities. One successful example involves startup TerViva.  Cultivo helps farmers finance the growth of pongamia, a 1000-year plant protein, which has similar properties to soy, but is a less intensive crop for the soil. The proven sustainability benefits of pongamia can then be translated into carbon credits – this in turn creates a new revenue stream for the farmers.  Dr Pinuela says that “while the pipeline of nature-based solutions is large, one of the painpoints that institutions and corporations have is that it is difficult to find high quality projects.”  Defining what he means by high quality, he continues to say that natural capital should create a flow of ecosystem services, or “the ability to capture carbon and maintain biodiversity.” A distressed asset like a degraded forest, grassland or wetland must be considered, as the tonnes of CO2 captured, number of species protected, or amount of water captured could be substantial.  Therefore, fintech startups like Cultivo work with NGOs to connect financial institutions and landowners so that they understand whether their land can be restored using data. In the same way that all businesses now have a corporate responsibility to fight climate change consistent with the Paris Accord, there is no excuse for financial institutions not utilising sustainable data.  Dr Pinuela takes this one step further and states that while there is no excuse when considering the abundance and granularity of data available, humans are also on a tight deadline to restore the planet.  Alongside this, incremental changes such as planting trees are being made, but as Dr Pinuela explains, other landscapes need to be considered in line with the economic impact on rural communities. ", "source": "Finextra"},
{"category": "payments", "article_link": "/newsarticle/37579/facebook-and-google-eye-indian-digital-payment-network---economic-times", "title": "Facebook and Google eye Indian digital payment network - Economic Times", "datetime": "2021-03-02 00:20:53", "image": "/finextra-images/top_pics/xl/5443.jpg", "desc": "Facebook and Google are teaming up with Indian firms Infibeam and Reliance Industries on an application to set up a national digital payment network in the South Asian country, according to the Economic Times.The Reserve Bank of India has invited companies to create new umbrella entities (NUEs) that build payments networks that offer an alternative to the bank-owned not-for-profit National Payments Council of India. Citing sources, the Economic Times says that Google, Facebook, conglomerate Reliance and fintech firm Infibeam are at an advanced stage in submitting their plan to the central bank. Google and Facebook (through WhatsApp) are already significant players in the fast-growing Indian digital payments market. Another American giant, Amazon, is rumoured to have teamed up with ICICI Bank to explore its own NUE play. The Reserve Bank is expected to award two licences.", "source": "Finextra"},
{"category": "retail", "article_link": "/newsarticle/37578/bbva-experiments-with-ai-to-summarise-customer-conversations", "title": "BBVA experiments with AI to summarise customer conversations", "datetime": "2021-03-02 08:20:54", "image": "/finextra-images/top_pics/xl/ai%20brain.jpg", "desc": "BBVA says it has had \"encouraging\" results testing an out-of-the-box AI language model to summarise Spanish customer conversations about banking.BBVA has been experimenting with an open API for GPT-3 (Generative Pre-trained Transformer 3), a language model from vendor OpenAI. The lender says it wanted to see if the technology could be useful in generating summaries of conversation with customers that can then be used by bank staff, saving them time and improving the user experience. BBVA used the model on ten unedited Spanish conversations about banking extracted from publicly available online forums. Without any previous fine-tuning, transfer-learning or retraining on the domain’s data, in most cases GPT-3 Davinci managed to generate summaries, identifying the core issue or question, the product or service involved, the recommendation or answer given and its state of completion. The accuracy is not \"very high,\" says BBVA but \"the results obtained are encouraging and suggest further exploration of the model’s value for the targeted tasks\".", "source": "Finextra"},
{"category": "sustainable", "article_link": "/newsarticle/37572/f10-and-new-energy-nexus-unite-to-nurture-green-fintech", "title": "F10 and New Energy Nexus unite to nurture green fintech", "datetime": "2021-03-01 00:00:00", "image": "/finextra-images/top_pics/xl/5f47c89f62822f163be93d8fbrainstorming.jpeg", "desc": "F10, fintech incubator and accelerator, will collaborate with New Energy Nexus to form the first global green and climate fintech program, bringing decarbonisation of financial services to the cutting edge of innovation. Against the backdrop of numerous corporate net-zero pledges, New Energy Nexus will support startup selection, mentorship, programming, networking and investment.  While new business models, new user experiences and new companies have been at the centre of the fintech industry, this partnership comes at a critical time and on the cusp of a similar, burgeoning wave in the sustainable finance or green fintech space.  Aaron McCreary, climate fintech lead at New Energy Nexus, highlights that this convergence could not come sooner.  “The intersection of digital financial technology and the climate emergency is real. Climate Fintech can help to make net-zero pathways and clean energy more accessible, measurable, and bankable. We’re thrilled to partner with F10 to help bring Climate Fintech innovations to market – enabling both individuals and corporates to save, spend, lend, and invest in ways which put the planet first.\"  The climate fintech program will accompany F10’s existing core curriculum and the Zurich, Singapore, Madrid and Barcelona based banking and insurance incubator will also extend its current open call for applicants.  The application window for F10 Zurich Incubation Batch VII will be extended from 26 February to 9 March 2021 for green and climate fintech, insurtech, regtech and deeptech startups.  Andreas Iten, co-founder of F10, adds: “There is immense potential and a strong use case for Green & Climate FinTechs in the market. Together with New Energy Nexus we can create the perfect environment for these cutting-edge startups to thrive and positively impact the global financial sector.”  Startups accepted into the program will benefit from:   Up to CHF 15,000 of expense coverage  Up to CHF 150,000 in funding  Fintech and climate accelerator curriculum and startup support services  Mentorship around subjects such as ESG, carbon and energy problem-solving  Exposure to corporates interested in startups dedicated to carbon neutrality and open innovation in the fintech space  A network of fintech and climate tech VC and angel investors   In conversation with Finextra in 2020, McCreary explored how the California-headquartered non-profit has been fostering entrepreneurs with thematic accelerator programmes across the world, while at the same time, supporting the Hewlett Foundation’s five-year climate strategy, running until 2023.  “Fintech has already shown its ability to disrupt the financial system, but what happens if you use fintech with the goal of reducing greenhouse gas emissions specifically,” McCreary stated. It remains to be seen, but it is evident that fintech startups have the potential for substantial impact at scale.  Read New Energy Nexus' report on ‘Climate Fintech: Mapping an Emerging Ecosystem of Climate Capital Catalysts’. ", "source": "Finextra"},
{"category": "inclusion", "article_link": "/newsarticle/37568/hsbc-launches-programme-to-help-customers-go-digital", "title": "HSBC launches programme to help customers go digital", "datetime": "2021-03-01 00:00:00", "image": "/finextra-images/top_pics/xl/5207.jpg", "desc": "As it closes branches and Covid-19 hastens the move to digital channels, HSBC has launched an education programme to help customers make the transition to online and mobile banking.The HSBC@Home programme is designed to educate and upskill customers on a range of topics from digital tools and services to fraud and financial fitness. The sessions are delivered through live virtual webinars and are hosted by specially trained branch staff. Last month the bank said it will close 82 branches in the UK this year as the Covid-19 pandemic accelerates the trend away from in-person banking and towards digital channels. Some 90% of all customer contact now taking place over the phone, internet or smartphone, while the bank has seen over 750,000 new mobile app registrations in the last 12 months. However, with some people - including older people - less comfortable with digital services, HSBC is contacting customers and inviting them to join HSBC@Home. Over 350 specialists across HSBC UK branches have received training to deliver the programme and the bank has held around 200 sessions for customers so far. Jackie Uhi, Uk head of network, HSBC, says: \"With many people embracing digital as their primary banking channel - some for the first time - we have developed HSBC@Home to help build confidence and enhance their digital skillset. \"The programme, which will be delivered across our UK branches, covers everything from how to register for our digital services and what you can do via the mobile app and online banking, to guarding yourself against fraud.”", "source": "Finextra"},
{"category": "payments", "article_link": "/newsarticle/37576/klarna-confirms-mammoth-1-billion-fund-raise", "title": "Klarna confirms mammoth $1 billion fund raise", "datetime": "2021-03-01 20:20:56", "image": "/finextra-images/top_pics/xl/klarna.jpg", "desc": "Buy now, pay later giant Klarna has confirmed a $1 billion funding round, valuing the Swedish firm at $31 billion.The 4x oversubscribed round included a combination of new and existing investors and makes Klarna the highest-valued private fintech in Europe and the second highest worldwide. The fresh capital injection comes just six month's after Klarna's last $650 million funding round, which gave it a $10.65 billion price tag. The new capital comes as the BNPL sector experiences a worldwide boom. Klarna reports that worldwide volume and revenue for 2020 grew 46% and 40% year-on-year to more than $53 billion and $1 billion respectively. The company says it intends to pledge one percent of the capital raised to a new initiative that addresses sustainability challenges around the world. Sebastian Siemiatkowski, co-founder and CEO of Klarna, states: \"I believe our industry has a responsibility to help in some way solve global sustainability issues and I hope others will join Klarna in our ambition.\"", "source": "Finextra"}
][
{"category": "sustainable", "article_link": "/newsarticle/37573/fintechs-role-in-paris-agreement-success-and-restoration-of-nature-at-scale", "title": "Fintech’s role in Paris Agreement success and restoration of nature at scale", "datetime": "2021-03-02 16:00:57", "image": "/finextra-images/top_pics/xl/sustainable-3.jpg", "desc": "According to the UNFCCC High-Level Climate Champions and the Marrakech Partnership Climate Action Pathways report published at the end of 2020, certain notable breakthroughs are moving key sectors closer to the 2050 zero emissions goal, in an attempt to avert the impact of climate change. The report outlines the milestones required for limiting the global temperature rise to 1.5°C as per the 2015 Paris Agreement in the areas of energy, cities and other human settlements, industry, land use, oceans and coastal zones, transport, water and resilience.  In turn, this will provide a blueprint to coordinate climate ambition among cities, regions, businesses and investors in the run up to the UN Climate Change Conference in Glasgow in November 2021.  With a view that the restoration of nature at scale is crucial for the success of the goals highlighted in the Paris Agreement, emerging fintech Cultivo plans to deploy $1 billion into restoring at least 3.5 million hectares of land within the next five years, calling upon investors to utilise nature to protect biodiversity and capture CO2.  Dr Manuel Pinuela, co-founder and CEO of Cultivo, highlights how “nature-based solutions can provide at least 30% of the CO2 mitigation goals by 2030, yet receive only around 3% of the funding allocated to carbon capture.”  As a result, the fintech firm is on a mission to fill this “financing gap”, pushing the importance of natural restoration, carbon sequestration, and biodiversity protection.  Cultivo does this with “an innovative financing mechanism that connects financial institutions to NGOs and landowners in order to unlock investment into natural capital opportunities that restore nature, protect livelihoods, and deliver healthy financial returns to investors.”  The fintech uses proprietary algorithms and remote sensor technologies to identify high quality projects and forecast the natural capital returns, pooling investment products and providing financial institutions with a simple way to invest in sustainable projects, such as regenerative grazing or planting trees.  These generate carbon credits and other offsets that can be sold, providing a return to investors and a long-term reliable income stream to the landowners and local communities. One successful example involves startup TerViva.  Cultivo helps farmers finance the growth of pongamia, a 1000-year plant protein, which has similar properties to soy, but is a less intensive crop for the soil. The proven sustainability benefits of pongamia can then be translated into carbon credits – this in turn creates a new revenue stream for the farmers.  Dr Pinuela says that “while the pipeline of nature-based solutions is large, one of the painpoints that institutions and corporations have is that it is difficult to find high quality projects.”  Defining what he means by high quality, he continues to say that natural capital should create a flow of ecosystem services, or “the ability to capture carbon and maintain biodiversity.” A distressed asset like a degraded forest, grassland or wetland must be considered, as the tonnes of CO2 captured, number of species protected, or amount of water captured could be substantial.  Therefore, fintech startups like Cultivo work with NGOs to connect financial institutions and landowners so that they understand whether their land can be restored using data. In the same way that all businesses now have a corporate responsibility to fight climate change consistent with the Paris Accord, there is no excuse for financial institutions not utilising sustainable data.  Dr Pinuela takes this one step further and states that while there is no excuse when considering the abundance and granularity of data available, humans are also on a tight deadline to restore the planet.  Alongside this, incremental changes such as planting trees are being made, but as Dr Pinuela explains, other landscapes need to be considered in line with the economic impact on rural communities. ", "source": "Finextra"},
{"category": "sustainable", "article_link": "/newsarticle/37572/f10-and-new-energy-nexus-unite-to-nurture-green-fintech", "title": "F10 and New Energy Nexus unite to nurture green fintech", "datetime": "2021-03-01 00:00:00", "image": "/finextra-images/top_pics/xl/5f47c89f62822f163be93d8fbrainstorming.jpeg", "desc": "F10, fintech incubator and accelerator, will collaborate with New Energy Nexus to form the first global green and climate fintech program, bringing decarbonisation of financial services to the cutting edge of innovation. Against the backdrop of numerous corporate net-zero pledges, New Energy Nexus will support startup selection, mentorship, programming, networking and investment.  While new business models, new user experiences and new companies have been at the centre of the fintech industry, this partnership comes at a critical time and on the cusp of a similar, burgeoning wave in the sustainable finance or green fintech space.  Aaron McCreary, climate fintech lead at New Energy Nexus, highlights that this convergence could not come sooner.  “The intersection of digital financial technology and the climate emergency is real. Climate Fintech can help to make net-zero pathways and clean energy more accessible, measurable, and bankable. We’re thrilled to partner with F10 to help bring Climate Fintech innovations to market – enabling both individuals and corporates to save, spend, lend, and invest in ways which put the planet first.\"  The climate fintech program will accompany F10’s existing core curriculum and the Zurich, Singapore, Madrid and Barcelona based banking and insurance incubator will also extend its current open call for applicants.  The application window for F10 Zurich Incubation Batch VII will be extended from 26 February to 9 March 2021 for green and climate fintech, insurtech, regtech and deeptech startups.  Andreas Iten, co-founder of F10, adds: “There is immense potential and a strong use case for Green & Climate FinTechs in the market. Together with New Energy Nexus we can create the perfect environment for these cutting-edge startups to thrive and positively impact the global financial sector.”  Startups accepted into the program will benefit from:   Up to CHF 15,000 of expense coverage  Up to CHF 150,000 in funding  Fintech and climate accelerator curriculum and startup support services  Mentorship around subjects such as ESG, carbon and energy problem-solving  Exposure to corporates interested in startups dedicated to carbon neutrality and open innovation in the fintech space  A network of fintech and climate tech VC and angel investors   In conversation with Finextra in 2020, McCreary explored how the California-headquartered non-profit has been fostering entrepreneurs with thematic accelerator programmes across the world, while at the same time, supporting the Hewlett Foundation’s five-year climate strategy, running until 2023.  “Fintech has already shown its ability to disrupt the financial system, but what happens if you use fintech with the goal of reducing greenhouse gas emissions specifically,” McCreary stated. It remains to be seen, but it is evident that fintech startups have the potential for substantial impact at scale.  Read New Energy Nexus' report on ‘Climate Fintech: Mapping an Emerging Ecosystem of Climate Capital Catalysts’. ", "source": "Finextra"},
{"category": "payments", "article_link": "/newsarticle/37579/facebook-and-google-eye-indian-digital-payment-network---economic-times", "title": "Facebook and Google eye Indian digital payment network - Economic Times", "datetime": "2021-03-02 00:25:58", "image": "/finextra-images/top_pics/xl/5443.jpg", "desc": "Facebook and Google are teaming up with Indian firms Infibeam and Reliance Industries on an application to set up a national digital payment network in the South Asian country, according to the Economic Times.The Reserve Bank of India has invited companies to create new umbrella entities (NUEs) that build payments networks that offer an alternative to the bank-owned not-for-profit National Payments Council of India. Citing sources, the Economic Times says that Google, Facebook, conglomerate Reliance and fintech firm Infibeam are at an advanced stage in submitting their plan to the central bank. Google and Facebook (through WhatsApp) are already significant players in the fast-growing Indian digital payments market. Another American giant, Amazon, is rumoured to have teamed up with ICICI Bank to explore its own NUE play. The Reserve Bank is expected to award two licences.", "source": "Finextra"},
{"category": "regulation", "article_link": "/newsarticle/37571/regulators-make-inquiries-over-robinhood-trading-restrictions", "title": "Regulators make inquiries over Robinhood trading restrictions", "datetime": "2021-02-26 00:00:00", "image": "/finextra-images/top_pics/xl/robinhood-for-web.png", "desc": "US regulators have made inquiries to Robinhood about the trading restrictions the app put on stocks such as GameStop during the Reddit-led rallies earlier this year.Robinhood temporarily stopped users from buying dozens of stocks that day traders who use the WallStreetBets subreddit had targeted in a short squeeze assault. In a regulatory filing, the firm says it has received \"inquiries\" about its actions from the SEC, Finra, a number of state attorneys general offices and several state securities regulators. Meanwhile, Robinhood says it is aware of around 46 putative class actions and three individual actions that have been filed against it. \"The complaints generally allege breach of contract, breach of the implied covenant of good faith and fair dealing, negligence, breach of fiduciary duty and other common law claims,\" says the filing, adding: \"We believe that the claims in these lawsuits are without merit and intend to defend against them vigorously.\"", "source": "Finextra"},
{"category": "inclusion", "article_link": "/newsarticle/37580/first-boulevard-raises-5m-for-black-community-focused-neobank", "title": "First Boulevard raises $5m for Black community-focused neobank", "datetime": "2021-03-02 03:26:00", "image": "/finextra-images/top_pics/xl/firstboulevardfounders.jpg", "desc": "First Boulevard, a neobank focused on the Black community, has raised $5 million in a seed funding round joined by Barclays.Anthemis and angels such as Gabrielle Union, John Buttrick and Jamere Jackson joined the round for First Boulevard, which has set itself the goal of helping Black America build generational wealth. First Boulevard is one of several digital banks - including Tenth and Greenwood - that have emerged in recent months as The Black Lives Matter movement has led to a renewed focus on America's wealth gap and the financial services industry's role in it. Founded by serial entrepreneurs Donald Hawkins and Asya Bradley, the startup is building a platform that offers fee-free debit cards, financial education, a Black business marketplace which gives its members cashback for buying Black, and technology to help members automate their saving and wealth building goals. First Boulevard is a Visa Fintech Fast Track partner and was recently unveiled as the payment giant's partner for the first pilot of its new suite of crypto APIs, which will enable customers to purchase, custody and trade digital assets. Says Hawkins: \"History has proven that oppressed communities can succeed when their finances are centralized, and when it comes to financial services for the Black community, a centralizing force is long overdue. \"After viewing yet another tragedy engulf the Black community, and the all-too-familiar protests against persisting issues, it was beyond clear to me that the solutions Black America needs must be financially-focused and developed within our community.\"", "source": "Finextra"},
{"category": "inclusion", "article_link": "/newsarticle/37568/hsbc-launches-programme-to-help-customers-go-digital", "title": "HSBC launches programme to help customers go digital", "datetime": "2021-03-01 00:00:00", "image": "/finextra-images/top_pics/xl/5207.jpg", "desc": "As it closes branches and Covid-19 hastens the move to digital channels, HSBC has launched an education programme to help customers make the transition to online and mobile banking.The HSBC@Home programme is designed to educate and upskill customers on a range of topics from digital tools and services to fraud and financial fitness. The sessions are delivered through live virtual webinars and are hosted by specially trained branch staff. Last month the bank said it will close 82 branches in the UK this year as the Covid-19 pandemic accelerates the trend away from in-person banking and towards digital channels. Some 90% of all customer contact now taking place over the phone, internet or smartphone, while the bank has seen over 750,000 new mobile app registrations in the last 12 months. However, with some people - including older people - less comfortable with digital services, HSBC is contacting customers and inviting them to join HSBC@Home. Over 350 specialists across HSBC UK branches have received training to deliver the programme and the bank has held around 200 sessions for customers so far. Jackie Uhi, Uk head of network, HSBC, says: \"With many people embracing digital as their primary banking channel - some for the first time - we have developed HSBC@Home to help build confidence and enhance their digital skillset. \"The programme, which will be delivered across our UK branches, covers everything from how to register for our digital services and what you can do via the mobile app and online banking, to guarding yourself against fraud.”", "source": "Finextra"},
{"category": "payments", "article_link": "/newsarticle/37576/klarna-confirms-mammoth-1-billion-fund-raise", "title": "Klarna confirms mammoth $1 billion fund raise", "datetime": "2021-03-01 20:26:01", "image": "/finextra-images/top_pics/xl/klarna.jpg", "desc": "Buy now, pay later giant Klarna has confirmed a $1 billion funding round, valuing the Swedish firm at $31 billion.The 4x oversubscribed round included a combination of new and existing investors and makes Klarna the highest-valued private fintech in Europe and the second highest worldwide. The fresh capital injection comes just six month's after Klarna's last $650 million funding round, which gave it a $10.65 billion price tag. The new capital comes as the BNPL sector experiences a worldwide boom. Klarna reports that worldwide volume and revenue for 2020 grew 46% and 40% year-on-year to more than $53 billion and $1 billion respectively. The company says it intends to pledge one percent of the capital raised to a new initiative that addresses sustainability challenges around the world. Sebastian Siemiatkowski, co-founder and CEO of Klarna, states: \"I believe our industry has a responsibility to help in some way solve global sustainability issues and I hope others will join Klarna in our ambition.\"", "source": "Finextra"},
{"category": "retail", "article_link": "/newsarticle/37575/bank-of-ireland-to-close-a-third-of-branch-network", "title": "Bank of Ireland to close a third of branch network", "datetime": "2021-03-01 19:26:01", "image": "/finextra-images/top_pics/xl/bank-of-ireland-3.jpg", "desc": "The Bank of Ireland is to shut a third of its branches as it reaches a digital \"tipping point\" between online and offline transactions.The bank is to shutter 88 outlets in the Republic, reducing its network from 257 to 169, while in Northern Ireland the network will be reduced by 15 from 28 to 13. The move is expected to generate €26 billion in annualised cost savings. Francesca McDonagh, Bank of Ireland CEO, says: For many years, the trend to digital banking has been evident, with customers using branches less and less. Covid-19 has accelerated this changing behaviour, and we’ve seen a seismic shift towards digital banking over the past 12 months. We’ve now reached a tipping point in customer preferences between online and offline banking.\" She says 70% of customers are now digitally active, with a 26% increase in customers registering for the new mobile app since launch. The branch closure programme comes as part of a new three-year strategy to trim costs by €1.5 billion, entailing a reduction in 1400 full time roles achieved through voluntary redundancies. Up to 200 jobs will be impacted by the branch takedowns, which will mostly hit umanned outlets.", "source": "Finextra"},
{"category": "retail", "article_link": "/newsarticle/37578/bbva-experiments-with-ai-to-summarise-customer-conversations", "title": "BBVA experiments with AI to summarise customer conversations", "datetime": "2021-03-02 08:26:02", "image": "/finextra-images/top_pics/xl/ai%20brain.jpg", "desc": "BBVA says it has had \"encouraging\" results testing an out-of-the-box AI language model to summarise Spanish customer conversations about banking.BBVA has been experimenting with an open API for GPT-3 (Generative Pre-trained Transformer 3), a language model from vendor OpenAI. The lender says it wanted to see if the technology could be useful in generating summaries of conversation with customers that can then be used by bank staff, saving them time and improving the user experience. BBVA used the model on ten unedited Spanish conversations about banking extracted from publicly available online forums. Without any previous fine-tuning, transfer-learning or retraining on the domain’s data, in most cases GPT-3 Davinci managed to generate summaries, identifying the core issue or question, the product or service involved, the recommendation or answer given and its state of completion. The accuracy is not \"very high,\" says BBVA but \"the results obtained are encouraging and suggest further exploration of the model’s value for the targeted tasks\".", "source": "Finextra"}
][
{"category": "retail", "article_link": "/newsarticle/37578/bbva-experiments-with-ai-to-summarise-customer-conversations", "title": "BBVA experiments with AI to summarise customer conversations", "datetime": "2021-03-02 08:29:54", "image": "/finextra-images/top_pics/xl/ai%20brain.jpg", "desc": "BBVA says it has had \"encouraging\" results testing an out-of-the-box AI language model to summarise Spanish customer conversations about banking.BBVA has been experimenting with an open API for GPT-3 (Generative Pre-trained Transformer 3), a language model from vendor OpenAI. The lender says it wanted to see if the technology could be useful in generating summaries of conversation with customers that can then be used by bank staff, saving them time and improving the user experience. BBVA used the model on ten unedited Spanish conversations about banking extracted from publicly available online forums. Without any previous fine-tuning, transfer-learning or retraining on the domain’s data, in most cases GPT-3 Davinci managed to generate summaries, identifying the core issue or question, the product or service involved, the recommendation or answer given and its state of completion. The accuracy is not \"very high,\" says BBVA but \"the results obtained are encouraging and suggest further exploration of the model’s value for the targeted tasks\".", "source": "Finextra"},
{"category": "payments", "article_link": "/newsarticle/37576/klarna-confirms-mammoth-1-billion-fund-raise", "title": "Klarna confirms mammoth $1 billion fund raise", "datetime": "2021-03-01 20:29:54", "image": "/finextra-images/top_pics/xl/klarna.jpg", "desc": "Buy now, pay later giant Klarna has confirmed a $1 billion funding round, valuing the Swedish firm at $31 billion.The 4x oversubscribed round included a combination of new and existing investors and makes Klarna the highest-valued private fintech in Europe and the second highest worldwide. The fresh capital injection comes just six month's after Klarna's last $650 million funding round, which gave it a $10.65 billion price tag. The new capital comes as the BNPL sector experiences a worldwide boom. Klarna reports that worldwide volume and revenue for 2020 grew 46% and 40% year-on-year to more than $53 billion and $1 billion respectively. The company says it intends to pledge one percent of the capital raised to a new initiative that addresses sustainability challenges around the world. Sebastian Siemiatkowski, co-founder and CEO of Klarna, states: \"I believe our industry has a responsibility to help in some way solve global sustainability issues and I hope others will join Klarna in our ambition.\"", "source": "Finextra"},
{"category": "retail", "article_link": "/newsarticle/37575/bank-of-ireland-to-close-a-third-of-branch-network", "title": "Bank of Ireland to close a third of branch network", "datetime": "2021-03-01 19:29:54", "image": "/finextra-images/top_pics/xl/bank-of-ireland-3.jpg", "desc": "The Bank of Ireland is to shut a third of its branches as it reaches a digital \"tipping point\" between online and offline transactions.The bank is to shutter 88 outlets in the Republic, reducing its network from 257 to 169, while in Northern Ireland the network will be reduced by 15 from 28 to 13. The move is expected to generate €26 billion in annualised cost savings. Francesca McDonagh, Bank of Ireland CEO, says: For many years, the trend to digital banking has been evident, with customers using branches less and less. Covid-19 has accelerated this changing behaviour, and we’ve seen a seismic shift towards digital banking over the past 12 months. We’ve now reached a tipping point in customer preferences between online and offline banking.\" She says 70% of customers are now digitally active, with a 26% increase in customers registering for the new mobile app since launch. The branch closure programme comes as part of a new three-year strategy to trim costs by €1.5 billion, entailing a reduction in 1400 full time roles achieved through voluntary redundancies. Up to 200 jobs will be impacted by the branch takedowns, which will mostly hit umanned outlets.", "source": "Finextra"},
{"category": "regulation", "article_link": "/newsarticle/37571/regulators-make-inquiries-over-robinhood-trading-restrictions", "title": "Regulators make inquiries over Robinhood trading restrictions", "datetime": "2021-02-26 00:00:00", "image": "/finextra-images/top_pics/xl/robinhood-for-web.png", "desc": "US regulators have made inquiries to Robinhood about the trading restrictions the app put on stocks such as GameStop during the Reddit-led rallies earlier this year.Robinhood temporarily stopped users from buying dozens of stocks that day traders who use the WallStreetBets subreddit had targeted in a short squeeze assault. In a regulatory filing, the firm says it has received \"inquiries\" about its actions from the SEC, Finra, a number of state attorneys general offices and several state securities regulators. Meanwhile, Robinhood says it is aware of around 46 putative class actions and three individual actions that have been filed against it. \"The complaints generally allege breach of contract, breach of the implied covenant of good faith and fair dealing, negligence, breach of fiduciary duty and other common law claims,\" says the filing, adding: \"We believe that the claims in these lawsuits are without merit and intend to defend against them vigorously.\"", "source": "Finextra"},
{"category": "payments", "article_link": "/newsarticle/37579/facebook-and-google-eye-indian-digital-payment-network---economic-times", "title": "Facebook and Google eye Indian digital payment network - Economic Times", "datetime": "2021-03-02 00:29:55", "image": "/finextra-images/top_pics/xl/5443.jpg", "desc": "Facebook and Google are teaming up with Indian firms Infibeam and Reliance Industries on an application to set up a national digital payment network in the South Asian country, according to the Economic Times.The Reserve Bank of India has invited companies to create new umbrella entities (NUEs) that build payments networks that offer an alternative to the bank-owned not-for-profit National Payments Council of India. Citing sources, the Economic Times says that Google, Facebook, conglomerate Reliance and fintech firm Infibeam are at an advanced stage in submitting their plan to the central bank. Google and Facebook (through WhatsApp) are already significant players in the fast-growing Indian digital payments market. Another American giant, Amazon, is rumoured to have teamed up with ICICI Bank to explore its own NUE play. The Reserve Bank is expected to award two licences.", "source": "Finextra"},
{"category": "inclusion", "article_link": "/newsarticle/37570/stori-raises-325m-to-bring-credit-cards-to-mexicos-middle-class", "title": "Stori raises $32.5m to bring credit cards to Mexico''s middle class", "datetime": "2021-03-01 00:00:00", "image": "/finextra-images/top_pics/xl/jorge-aguilar-vz9tqsm9zsq-unsplash.jpg", "desc": "Mexican fintech Stori has raised $32.5 million in a Series B funding round to bring credit cards to the country's middles class.Lightspeed Venture Partners led the round with participation from existing investors Vision Plus Capital, BAI Capital and Source Code Capital. Stori is building a digital banking platform but is currently focussed on credit card issuing, targeting Mexico’s mass-middle and emerging-middle income populations. Currently, less than 15% of Mexico’s adult population have access to a credit card. Meanwhile, Brazil, with similar GDP per capita, sees three times higher penetration. This is largely because many people do not have a solid credit history, something Stori is tackling by using machine learning to improve underwriting. The company has also introduced a full in-app experience, meaning that people do not need to go to a physical location to apply for a card. Stori CEO Bin Chen, who has worked at Capital One and Mastercard, says: \"By tailoring global best practices in underwriting, technology and user-friendly design, combined with rapid iterations, we’ve found the right formula to deliver a compelling product and experience to the large underserved population in Mexico\"", "source": "Finextra"},
{"category": "people", "article_link": "/newsarticle/37574/walmart-recruits-goldman-sachs-consumer-head-to-run-fintech-startup", "title": "Walmart recruits Goldman Sachs'' consumer head to run fintech startup", "datetime": "2021-03-01 18:29:56", "image": "/finextra-images/top_pics/xl/omer-ismai.jpg", "desc": "Omer Ismail, the head of Goldman Sachs' consumer business, is decamping to Walmart to take charge of the US retail chain's up-and-coming fintech startup.The news of Ismail's departure was reported by Bloomberg on Sunday. He is taking one of his top lieutenants, David Stark, with him to the new venture. Both men had been entrusted with key roles in Goldman Sachs' push into the retail market - Ismail guiding the development of Marcus, and Stark as head of Apple credit card. “Our business has serious momentum and a deep and growing bench of talent. We wish these two well,” Goldman Sachs spokesman said in an emailed statement. Nonetheless, the recruitment is seen as a serious coup for Walmart and a statement of intent on its ambitions for its new fintech joint venture with Ribbit Capital. Announced in January, the venture will bring together Walmart’s retail knowledge and scale with Ribbit’s fintech expertise to deliver \"tech-driven financial experiences tailored to Walmart’s customers and associates\". Although details are scant, the calibre of the new hires implies that Walmart may be preparing for a full-scale assault on the banking market.", "source": "Finextra"},
{"category": "sustainable", "article_link": "/newsarticle/37572/f10-and-new-energy-nexus-unite-to-nurture-green-fintech", "title": "F10 and New Energy Nexus unite to nurture green fintech", "datetime": "2021-03-01 00:00:00", "image": "/finextra-images/top_pics/xl/5f47c89f62822f163be93d8fbrainstorming.jpeg", "desc": "F10, fintech incubator and accelerator, will collaborate with New Energy Nexus to form the first global green and climate fintech program, bringing decarbonisation of financial services to the cutting edge of innovation. Against the backdrop of numerous corporate net-zero pledges, New Energy Nexus will support startup selection, mentorship, programming, networking and investment.  While new business models, new user experiences and new companies have been at the centre of the fintech industry, this partnership comes at a critical time and on the cusp of a similar, burgeoning wave in the sustainable finance or green fintech space.  Aaron McCreary, climate fintech lead at New Energy Nexus, highlights that this convergence could not come sooner.  “The intersection of digital financial technology and the climate emergency is real. Climate Fintech can help to make net-zero pathways and clean energy more accessible, measurable, and bankable. We’re thrilled to partner with F10 to help bring Climate Fintech innovations to market – enabling both individuals and corporates to save, spend, lend, and invest in ways which put the planet first.\"  The climate fintech program will accompany F10’s existing core curriculum and the Zurich, Singapore, Madrid and Barcelona based banking and insurance incubator will also extend its current open call for applicants.  The application window for F10 Zurich Incubation Batch VII will be extended from 26 February to 9 March 2021 for green and climate fintech, insurtech, regtech and deeptech startups.  Andreas Iten, co-founder of F10, adds: “There is immense potential and a strong use case for Green & Climate FinTechs in the market. Together with New Energy Nexus we can create the perfect environment for these cutting-edge startups to thrive and positively impact the global financial sector.”  Startups accepted into the program will benefit from:   Up to CHF 15,000 of expense coverage  Up to CHF 150,000 in funding  Fintech and climate accelerator curriculum and startup support services  Mentorship around subjects such as ESG, carbon and energy problem-solving  Exposure to corporates interested in startups dedicated to carbon neutrality and open innovation in the fintech space  A network of fintech and climate tech VC and angel investors   In conversation with Finextra in 2020, McCreary explored how the California-headquartered non-profit has been fostering entrepreneurs with thematic accelerator programmes across the world, while at the same time, supporting the Hewlett Foundation’s five-year climate strategy, running until 2023.  “Fintech has already shown its ability to disrupt the financial system, but what happens if you use fintech with the goal of reducing greenhouse gas emissions specifically,” McCreary stated. It remains to be seen, but it is evident that fintech startups have the potential for substantial impact at scale.  Read New Energy Nexus' report on ‘Climate Fintech: Mapping an Emerging Ecosystem of Climate Capital Catalysts’. ", "source": "Finextra"},
{"category": "sustainable", "article_link": "/newsarticle/37573/fintechs-role-in-paris-agreement-success-and-restoration-of-nature-at-scale", "title": "Fintech’s role in Paris Agreement success and restoration of nature at scale", "datetime": "2021-03-02 16:00:58", "image": "/finextra-images/top_pics/xl/sustainable-3.jpg", "desc": "According to the UNFCCC High-Level Climate Champions and the Marrakech Partnership Climate Action Pathways report published at the end of 2020, certain notable breakthroughs are moving key sectors closer to the 2050 zero emissions goal, in an attempt to avert the impact of climate change. The report outlines the milestones required for limiting the global temperature rise to 1.5°C as per the 2015 Paris Agreement in the areas of energy, cities and other human settlements, industry, land use, oceans and coastal zones, transport, water and resilience.  In turn, this will provide a blueprint to coordinate climate ambition among cities, regions, businesses and investors in the run up to the UN Climate Change Conference in Glasgow in November 2021.  With a view that the restoration of nature at scale is crucial for the success of the goals highlighted in the Paris Agreement, emerging fintech Cultivo plans to deploy $1 billion into restoring at least 3.5 million hectares of land within the next five years, calling upon investors to utilise nature to protect biodiversity and capture CO2.  Dr Manuel Pinuela, co-founder and CEO of Cultivo, highlights how “nature-based solutions can provide at least 30% of the CO2 mitigation goals by 2030, yet receive only around 3% of the funding allocated to carbon capture.”  As a result, the fintech firm is on a mission to fill this “financing gap”, pushing the importance of natural restoration, carbon sequestration, and biodiversity protection.  Cultivo does this with “an innovative financing mechanism that connects financial institutions to NGOs and landowners in order to unlock investment into natural capital opportunities that restore nature, protect livelihoods, and deliver healthy financial returns to investors.”  The fintech uses proprietary algorithms and remote sensor technologies to identify high quality projects and forecast the natural capital returns, pooling investment products and providing financial institutions with a simple way to invest in sustainable projects, such as regenerative grazing or planting trees.  These generate carbon credits and other offsets that can be sold, providing a return to investors and a long-term reliable income stream to the landowners and local communities. One successful example involves startup TerViva.  Cultivo helps farmers finance the growth of pongamia, a 1000-year plant protein, which has similar properties to soy, but is a less intensive crop for the soil. The proven sustainability benefits of pongamia can then be translated into carbon credits – this in turn creates a new revenue stream for the farmers.  Dr Pinuela says that “while the pipeline of nature-based solutions is large, one of the painpoints that institutions and corporations have is that it is difficult to find high quality projects.”  Defining what he means by high quality, he continues to say that natural capital should create a flow of ecosystem services, or “the ability to capture carbon and maintain biodiversity.” A distressed asset like a degraded forest, grassland or wetland must be considered, as the tonnes of CO2 captured, number of species protected, or amount of water captured could be substantial.  Therefore, fintech startups like Cultivo work with NGOs to connect financial institutions and landowners so that they understand whether their land can be restored using data. In the same way that all businesses now have a corporate responsibility to fight climate change consistent with the Paris Accord, there is no excuse for financial institutions not utilising sustainable data.  Dr Pinuela takes this one step further and states that while there is no excuse when considering the abundance and granularity of data available, humans are also on a tight deadline to restore the planet.  Alongside this, incremental changes such as planting trees are being made, but as Dr Pinuela explains, other landscapes need to be considered in line with the economic impact on rural communities. ", "source": "Finextra"},
{"category": "inclusion", "article_link": "/newsarticle/37580/first-boulevard-raises-5m-for-black-community-focused-neobank", "title": "First Boulevard raises $5m for Black community-focused neobank", "datetime": "2021-03-02 03:29:58", "image": "/finextra-images/top_pics/xl/firstboulevardfounders.jpg", "desc": "First Boulevard, a neobank focused on the Black community, has raised $5 million in a seed funding round joined by Barclays.Anthemis and angels such as Gabrielle Union, John Buttrick and Jamere Jackson joined the round for First Boulevard, which has set itself the goal of helping Black America build generational wealth. First Boulevard is one of several digital banks - including Tenth and Greenwood - that have emerged in recent months as The Black Lives Matter movement has led to a renewed focus on America's wealth gap and the financial services industry's role in it. Founded by serial entrepreneurs Donald Hawkins and Asya Bradley, the startup is building a platform that offers fee-free debit cards, financial education, a Black business marketplace which gives its members cashback for buying Black, and technology to help members automate their saving and wealth building goals. First Boulevard is a Visa Fintech Fast Track partner and was recently unveiled as the payment giant's partner for the first pilot of its new suite of crypto APIs, which will enable customers to purchase, custody and trade digital assets. Says Hawkins: \"History has proven that oppressed communities can succeed when their finances are centralized, and when it comes to financial services for the Black community, a centralizing force is long overdue. \"After viewing yet another tragedy engulf the Black community, and the all-too-familiar protests against persisting issues, it was beyond clear to me that the solutions Black America needs must be financially-focused and developed within our community.\"", "source": "Finextra"},
{"category": "inclusion", "article_link": "/newsarticle/37568/hsbc-launches-programme-to-help-customers-go-digital", "title": "HSBC launches programme to help customers go digital", "datetime": "2021-03-01 00:00:00", "image": "/finextra-images/top_pics/xl/5207.jpg", "desc": "As it closes branches and Covid-19 hastens the move to digital channels, HSBC has launched an education programme to help customers make the transition to online and mobile banking.The HSBC@Home programme is designed to educate and upskill customers on a range of topics from digital tools and services to fraud and financial fitness. The sessions are delivered through live virtual webinars and are hosted by specially trained branch staff. Last month the bank said it will close 82 branches in the UK this year as the Covid-19 pandemic accelerates the trend away from in-person banking and towards digital channels. Some 90% of all customer contact now taking place over the phone, internet or smartphone, while the bank has seen over 750,000 new mobile app registrations in the last 12 months. However, with some people - including older people - less comfortable with digital services, HSBC is contacting customers and inviting them to join HSBC@Home. Over 350 specialists across HSBC UK branches have received training to deliver the programme and the bank has held around 200 sessions for customers so far. Jackie Uhi, Uk head of network, HSBC, says: \"With many people embracing digital as their primary banking channel - some for the first time - we have developed HSBC@Home to help build confidence and enhance their digital skillset. \"The programme, which will be delivered across our UK branches, covers everything from how to register for our digital services and what you can do via the mobile app and online banking, to guarding yourself against fraud.”", "source": "Finextra"},
{"category": "sustainable", "article_link": "/newsarticle/37577/fintechs-join-uk-tech-zero-climate-taskforce", "title": "Fintechs join UK ''Tech Zero'' climate taskforce", "datetime": "2021-03-01 21:29:59", "image": "/finextra-images/top_pics/xl/sustainable-3.jpg", "desc": "Revolut, Starling and Wise are among a host of UK fintechs to join a new 'Tech Zero' taskforce to tackle climate change.Led by green energy supplier Bulb, the taskforce has set itself the aim of accelerating the UK government's plan to reach net zero emissions by 2050. Fintechs GoCardless, Moneysupermarket Group and Onfido have joined as founding members of the taskforce, which is backed by Tech Nation and the UK's Net Zero business champion, Andrew Griffith MP. The group says it plans to set \"ambitious, but achievable\" emission targets and to help the UK become the top destination for green investment while also helping consumers make greener choices. While the taskforce has only 15 founder members, it has set itself a target of bringing at least 1000 British tech firms onboard ahead of the COP26 UN Climate Conference later this year.", "source": "Finextra"}
][
{"category": "sustainable", "article_link": "/newsarticle/37573/fintechs-role-in-paris-agreement-success-and-restoration-of-nature-at-scale", "title": "Fintech’s role in Paris Agreement success and restoration of nature at scale", "datetime": "2021-03-02 16:03:03", "image": "/finextra-images/top_pics/xl/sustainable-3.jpg", "desc": "According to the UNFCCC High-Level Climate Champions and the Marrakech Partnership Climate Action Pathways report published at the end of 2020, certain notable breakthroughs are moving key sectors closer to the 2050 zero emissions goal, in an attempt to avert the impact of climate change. The report outlines the milestones required for limiting the global temperature rise to 1.5°C as per the 2015 Paris Agreement in the areas of energy, cities and other human settlements, industry, land use, oceans and coastal zones, transport, water and resilience.  In turn, this will provide a blueprint to coordinate climate ambition among cities, regions, businesses and investors in the run up to the UN Climate Change Conference in Glasgow in November 2021.  With a view that the restoration of nature at scale is crucial for the success of the goals highlighted in the Paris Agreement, emerging fintech Cultivo plans to deploy $1 billion into restoring at least 3.5 million hectares of land within the next five years, calling upon investors to utilise nature to protect biodiversity and capture CO2.  Dr Manuel Pinuela, co-founder and CEO of Cultivo, highlights how “nature-based solutions can provide at least 30% of the CO2 mitigation goals by 2030, yet receive only around 3% of the funding allocated to carbon capture.”  As a result, the fintech firm is on a mission to fill this “financing gap”, pushing the importance of natural restoration, carbon sequestration, and biodiversity protection.  Cultivo does this with “an innovative financing mechanism that connects financial institutions to NGOs and landowners in order to unlock investment into natural capital opportunities that restore nature, protect livelihoods, and deliver healthy financial returns to investors.”  The fintech uses proprietary algorithms and remote sensor technologies to identify high quality projects and forecast the natural capital returns, pooling investment products and providing financial institutions with a simple way to invest in sustainable projects, such as regenerative grazing or planting trees.  These generate carbon credits and other offsets that can be sold, providing a return to investors and a long-term reliable income stream to the landowners and local communities. One successful example involves startup TerViva.  Cultivo helps farmers finance the growth of pongamia, a 1000-year plant protein, which has similar properties to soy, but is a less intensive crop for the soil. The proven sustainability benefits of pongamia can then be translated into carbon credits – this in turn creates a new revenue stream for the farmers.  Dr Pinuela says that “while the pipeline of nature-based solutions is large, one of the painpoints that institutions and corporations have is that it is difficult to find high quality projects.”  Defining what he means by high quality, he continues to say that natural capital should create a flow of ecosystem services, or “the ability to capture carbon and maintain biodiversity.” A distressed asset like a degraded forest, grassland or wetland must be considered, as the tonnes of CO2 captured, number of species protected, or amount of water captured could be substantial.  Therefore, fintech startups like Cultivo work with NGOs to connect financial institutions and landowners so that they understand whether their land can be restored using data. In the same way that all businesses now have a corporate responsibility to fight climate change consistent with the Paris Accord, there is no excuse for financial institutions not utilising sustainable data.  Dr Pinuela takes this one step further and states that while there is no excuse when considering the abundance and granularity of data available, humans are also on a tight deadline to restore the planet.  Alongside this, incremental changes such as planting trees are being made, but as Dr Pinuela explains, other landscapes need to be considered in line with the economic impact on rural communities. ", "source": "Finextra"},
{"category": "regulation", "article_link": "/newsarticle/37571/regulators-make-inquiries-over-robinhood-trading-restrictions", "title": "Regulators make inquiries over Robinhood trading restrictions", "datetime": "2021-02-26 00:00:00", "image": "/finextra-images/top_pics/xl/robinhood-for-web.png", "desc": "US regulators have made inquiries to Robinhood about the trading restrictions the app put on stocks such as GameStop during the Reddit-led rallies earlier this year.Robinhood temporarily stopped users from buying dozens of stocks that day traders who use the WallStreetBets subreddit had targeted in a short squeeze assault. In a regulatory filing, the firm says it has received \"inquiries\" about its actions from the SEC, Finra, a number of state attorneys general offices and several state securities regulators. Meanwhile, Robinhood says it is aware of around 46 putative class actions and three individual actions that have been filed against it. \"The complaints generally allege breach of contract, breach of the implied covenant of good faith and fair dealing, negligence, breach of fiduciary duty and other common law claims,\" says the filing, adding: \"We believe that the claims in these lawsuits are without merit and intend to defend against them vigorously.\"", "source": "Finextra"},
{"category": "retail", "article_link": "/newsarticle/37575/bank-of-ireland-to-close-a-third-of-branch-network", "title": "Bank of Ireland to close a third of branch network", "datetime": "2021-03-01 19:03:04", "image": "/finextra-images/top_pics/xl/bank-of-ireland-3.jpg", "desc": "The Bank of Ireland is to shut a third of its branches as it reaches a digital \"tipping point\" between online and offline transactions.The bank is to shutter 88 outlets in the Republic, reducing its network from 257 to 169, while in Northern Ireland the network will be reduced by 15 from 28 to 13. The move is expected to generate €26 billion in annualised cost savings. Francesca McDonagh, Bank of Ireland CEO, says: For many years, the trend to digital banking has been evident, with customers using branches less and less. Covid-19 has accelerated this changing behaviour, and we’ve seen a seismic shift towards digital banking over the past 12 months. We’ve now reached a tipping point in customer preferences between online and offline banking.\" She says 70% of customers are now digitally active, with a 26% increase in customers registering for the new mobile app since launch. The branch closure programme comes as part of a new three-year strategy to trim costs by €1.5 billion, entailing a reduction in 1400 full time roles achieved through voluntary redundancies. Up to 200 jobs will be impacted by the branch takedowns, which will mostly hit umanned outlets.", "source": "Finextra"},
{"category": "payments", "article_link": "/newsarticle/37579/facebook-and-google-eye-indian-digital-payment-network---economic-times", "title": "Facebook and Google eye Indian digital payment network - Economic Times", "datetime": "2021-03-02 00:03:04", "image": "/finextra-images/top_pics/xl/5443.jpg", "desc": "Facebook and Google are teaming up with Indian firms Infibeam and Reliance Industries on an application to set up a national digital payment network in the South Asian country, according to the Economic Times.The Reserve Bank of India has invited companies to create new umbrella entities (NUEs) that build payments networks that offer an alternative to the bank-owned not-for-profit National Payments Council of India. Citing sources, the Economic Times says that Google, Facebook, conglomerate Reliance and fintech firm Infibeam are at an advanced stage in submitting their plan to the central bank. Google and Facebook (through WhatsApp) are already significant players in the fast-growing Indian digital payments market. Another American giant, Amazon, is rumoured to have teamed up with ICICI Bank to explore its own NUE play. The Reserve Bank is expected to award two licences.", "source": "Finextra"},
{"category": "sustainable", "article_link": "/newsarticle/37572/f10-and-new-energy-nexus-unite-to-nurture-green-fintech", "title": "F10 and New Energy Nexus unite to nurture green fintech", "datetime": "2021-03-01 00:00:00", "image": "/finextra-images/top_pics/xl/5f47c89f62822f163be93d8fbrainstorming.jpeg", "desc": "F10, fintech incubator and accelerator, will collaborate with New Energy Nexus to form the first global green and climate fintech program, bringing decarbonisation of financial services to the cutting edge of innovation. Against the backdrop of numerous corporate net-zero pledges, New Energy Nexus will support startup selection, mentorship, programming, networking and investment.  While new business models, new user experiences and new companies have been at the centre of the fintech industry, this partnership comes at a critical time and on the cusp of a similar, burgeoning wave in the sustainable finance or green fintech space.  Aaron McCreary, climate fintech lead at New Energy Nexus, highlights that this convergence could not come sooner.  “The intersection of digital financial technology and the climate emergency is real. Climate Fintech can help to make net-zero pathways and clean energy more accessible, measurable, and bankable. We’re thrilled to partner with F10 to help bring Climate Fintech innovations to market – enabling both individuals and corporates to save, spend, lend, and invest in ways which put the planet first.\"  The climate fintech program will accompany F10’s existing core curriculum and the Zurich, Singapore, Madrid and Barcelona based banking and insurance incubator will also extend its current open call for applicants.  The application window for F10 Zurich Incubation Batch VII will be extended from 26 February to 9 March 2021 for green and climate fintech, insurtech, regtech and deeptech startups.  Andreas Iten, co-founder of F10, adds: “There is immense potential and a strong use case for Green & Climate FinTechs in the market. Together with New Energy Nexus we can create the perfect environment for these cutting-edge startups to thrive and positively impact the global financial sector.”  Startups accepted into the program will benefit from:   Up to CHF 15,000 of expense coverage  Up to CHF 150,000 in funding  Fintech and climate accelerator curriculum and startup support services  Mentorship around subjects such as ESG, carbon and energy problem-solving  Exposure to corporates interested in startups dedicated to carbon neutrality and open innovation in the fintech space  A network of fintech and climate tech VC and angel investors   In conversation with Finextra in 2020, McCreary explored how the California-headquartered non-profit has been fostering entrepreneurs with thematic accelerator programmes across the world, while at the same time, supporting the Hewlett Foundation’s five-year climate strategy, running until 2023.  “Fintech has already shown its ability to disrupt the financial system, but what happens if you use fintech with the goal of reducing greenhouse gas emissions specifically,” McCreary stated. It remains to be seen, but it is evident that fintech startups have the potential for substantial impact at scale.  Read New Energy Nexus' report on ‘Climate Fintech: Mapping an Emerging Ecosystem of Climate Capital Catalysts’. ", "source": "Finextra"},
{"category": "retail", "article_link": "/newsarticle/37578/bbva-experiments-with-ai-to-summarise-customer-conversations", "title": "BBVA experiments with AI to summarise customer conversations", "datetime": "2021-03-02 08:03:04", "image": "/finextra-images/top_pics/xl/ai%20brain.jpg", "desc": "BBVA says it has had \"encouraging\" results testing an out-of-the-box AI language model to summarise Spanish customer conversations about banking.BBVA has been experimenting with an open API for GPT-3 (Generative Pre-trained Transformer 3), a language model from vendor OpenAI. The lender says it wanted to see if the technology could be useful in generating summaries of conversation with customers that can then be used by bank staff, saving them time and improving the user experience. BBVA used the model on ten unedited Spanish conversations about banking extracted from publicly available online forums. Without any previous fine-tuning, transfer-learning or retraining on the domain’s data, in most cases GPT-3 Davinci managed to generate summaries, identifying the core issue or question, the product or service involved, the recommendation or answer given and its state of completion. The accuracy is not \"very high,\" says BBVA but \"the results obtained are encouraging and suggest further exploration of the model’s value for the targeted tasks\".", "source": "Finextra"},
{"category": "inclusion", "article_link": "/newsarticle/37580/first-boulevard-raises-5m-for-black-community-focused-neobank", "title": "First Boulevard raises $5m for Black community-focused neobank", "datetime": "2021-03-02 03:03:05", "image": "/finextra-images/top_pics/xl/firstboulevardfounders.jpg", "desc": "First Boulevard, a neobank focused on the Black community, has raised $5 million in a seed funding round joined by Barclays.Anthemis and angels such as Gabrielle Union, John Buttrick and Jamere Jackson joined the round for First Boulevard, which has set itself the goal of helping Black America build generational wealth. First Boulevard is one of several digital banks - including Tenth and Greenwood - that have emerged in recent months as The Black Lives Matter movement has led to a renewed focus on America's wealth gap and the financial services industry's role in it. Founded by serial entrepreneurs Donald Hawkins and Asya Bradley, the startup is building a platform that offers fee-free debit cards, financial education, a Black business marketplace which gives its members cashback for buying Black, and technology to help members automate their saving and wealth building goals. First Boulevard is a Visa Fintech Fast Track partner and was recently unveiled as the payment giant's partner for the first pilot of its new suite of crypto APIs, which will enable customers to purchase, custody and trade digital assets. Says Hawkins: \"History has proven that oppressed communities can succeed when their finances are centralized, and when it comes to financial services for the Black community, a centralizing force is long overdue. \"After viewing yet another tragedy engulf the Black community, and the all-too-familiar protests against persisting issues, it was beyond clear to me that the solutions Black America needs must be financially-focused and developed within our community.\"", "source": "Finextra"},
{"category": "inclusion", "article_link": "/newsarticle/37568/hsbc-launches-programme-to-help-customers-go-digital", "title": "HSBC launches programme to help customers go digital", "datetime": "2021-03-01 00:00:00", "image": "/finextra-images/top_pics/xl/5207.jpg", "desc": "As it closes branches and Covid-19 hastens the move to digital channels, HSBC has launched an education programme to help customers make the transition to online and mobile banking.The HSBC@Home programme is designed to educate and upskill customers on a range of topics from digital tools and services to fraud and financial fitness. The sessions are delivered through live virtual webinars and are hosted by specially trained branch staff. Last month the bank said it will close 82 branches in the UK this year as the Covid-19 pandemic accelerates the trend away from in-person banking and towards digital channels. Some 90% of all customer contact now taking place over the phone, internet or smartphone, while the bank has seen over 750,000 new mobile app registrations in the last 12 months. However, with some people - including older people - less comfortable with digital services, HSBC is contacting customers and inviting them to join HSBC@Home. Over 350 specialists across HSBC UK branches have received training to deliver the programme and the bank has held around 200 sessions for customers so far. Jackie Uhi, Uk head of network, HSBC, says: \"With many people embracing digital as their primary banking channel - some for the first time - we have developed HSBC@Home to help build confidence and enhance their digital skillset. \"The programme, which will be delivered across our UK branches, covers everything from how to register for our digital services and what you can do via the mobile app and online banking, to guarding yourself against fraud.”", "source": "Finextra"},
{"category": "payments", "article_link": "/newsarticle/37576/klarna-confirms-mammoth-1-billion-fund-raise", "title": "Klarna confirms mammoth $1 billion fund raise", "datetime": "2021-03-01 21:03:06", "image": "/finextra-images/top_pics/xl/klarna.jpg", "desc": "Buy now, pay later giant Klarna has confirmed a $1 billion funding round, valuing the Swedish firm at $31 billion.The 4x oversubscribed round included a combination of new and existing investors and makes Klarna the highest-valued private fintech in Europe and the second highest worldwide. The fresh capital injection comes just six month's after Klarna's last $650 million funding round, which gave it a $10.65 billion price tag. The new capital comes as the BNPL sector experiences a worldwide boom. Klarna reports that worldwide volume and revenue for 2020 grew 46% and 40% year-on-year to more than $53 billion and $1 billion respectively. The company says it intends to pledge one percent of the capital raised to a new initiative that addresses sustainability challenges around the world. Sebastian Siemiatkowski, co-founder and CEO of Klarna, states: \"I believe our industry has a responsibility to help in some way solve global sustainability issues and I hope others will join Klarna in our ambition.\"", "source": "Finextra"}
][
{"category": "sustainable", "article_link": "/newsarticle/37573/fintechs-role-in-paris-agreement-success-and-restoration-of-nature-at-scale", "title": "Fintech’s role in Paris Agreement success and restoration of nature at scale", "datetime": "2021-03-02 16:10:28", "image": "/finextra-images/top_pics/xl/sustainable-3.jpg", "desc": "According to the UNFCCC High-Level Climate Champions and the Marrakech Partnership Climate Action Pathways report published at the end of 2020, certain notable breakthroughs are moving key sectors closer to the 2050 zero emissions goal, in an attempt to avert the impact of climate change. The report outlines the milestones required for limiting the global temperature rise to 1.5°C as per the 2015 Paris Agreement in the areas of energy, cities and other human settlements, industry, land use, oceans and coastal zones, transport, water and resilience.  In turn, this will provide a blueprint to coordinate climate ambition among cities, regions, businesses and investors in the run up to the UN Climate Change Conference in Glasgow in November 2021.  With a view that the restoration of nature at scale is crucial for the success of the goals highlighted in the Paris Agreement, emerging fintech Cultivo plans to deploy $1 billion into restoring at least 3.5 million hectares of land within the next five years, calling upon investors to utilise nature to protect biodiversity and capture CO2.  Dr Manuel Pinuela, co-founder and CEO of Cultivo, highlights how “nature-based solutions can provide at least 30% of the CO2 mitigation goals by 2030, yet receive only around 3% of the funding allocated to carbon capture.”  As a result, the fintech firm is on a mission to fill this “financing gap”, pushing the importance of natural restoration, carbon sequestration, and biodiversity protection.  Cultivo does this with “an innovative financing mechanism that connects financial institutions to NGOs and landowners in order to unlock investment into natural capital opportunities that restore nature, protect livelihoods, and deliver healthy financial returns to investors.”  The fintech uses proprietary algorithms and remote sensor technologies to identify high quality projects and forecast the natural capital returns, pooling investment products and providing financial institutions with a simple way to invest in sustainable projects, such as regenerative grazing or planting trees.  These generate carbon credits and other offsets that can be sold, providing a return to investors and a long-term reliable income stream to the landowners and local communities. One successful example involves startup TerViva.  Cultivo and TerViva are helping farmers finance the cultivation of pongamia, a tree crop used for thousands of years in Asian cultures. Pongamia produces oilseeds that have similar properties to soy and requires fewer chemical inputs, fixes nitrogen to regenerate soils, and sequesters carbon in the form of woody biomass. The proven sustainability benefits of pongamia can then be translated into carbon credits – this in turn creates a new revenue stream for the farmers.  Dr Pinuela says that “while the pipeline of nature-based solutions is large, one of the painpoints that institutions and corporations have is that it is difficult to find high quality projects.”  Defining what he means by high quality, he continues to say that natural capital should create a flow of ecosystem services, or “the ability to capture carbon and maintain biodiversity.” A distressed asset like a degraded forest, grassland or wetland must be considered, as the tonnes of CO2 captured, number of species protected, or amount of water captured could be substantial.  Therefore, fintech startups like Cultivo work with NGOs to connect financial institutions and landowners so that they understand whether their land can be restored using data. In the same way that all businesses now have a corporate responsibility to fight climate change consistent with the Paris Accord, there is no excuse for financial institutions not utilising sustainable data.  Dr Pinuela takes this one step further and states that while there is no excuse when considering the abundance and granularity of data available, humans are also on a tight deadline to restore the planet.  Alongside this, incremental changes such as planting trees are being made, but as Dr Pinuela explains, other landscapes need to be considered in line with the economic impact on rural communities. ", "source": "Finextra"},
{"category": "payments", "article_link": "/newsarticle/37579/facebook-and-google-eye-indian-digital-payment-network---economic-times", "title": "Facebook and Google eye Indian digital payment network - Economic Times", "datetime": "2021-03-02 00:10:28", "image": "/finextra-images/top_pics/xl/5443.jpg", "desc": "Facebook and Google are teaming up with Indian firms Infibeam and Reliance Industries on an application to set up a national digital payment network in the South Asian country, according to the Economic Times.The Reserve Bank of India has invited companies to create new umbrella entities (NUEs) that build payments networks that offer an alternative to the bank-owned not-for-profit National Payments Council of India. Citing sources, the Economic Times says that Google, Facebook, conglomerate Reliance and fintech firm Infibeam are at an advanced stage in submitting their plan to the central bank. Google and Facebook (through WhatsApp) are already significant players in the fast-growing Indian digital payments market. Another American giant, Amazon, is rumoured to have teamed up with ICICI Bank to explore its own NUE play. The Reserve Bank is expected to award two licences.", "source": "Finextra"},
{"category": "inclusion", "article_link": "/newsarticle/37580/first-boulevard-raises-5m-for-black-community-focused-neobank", "title": "First Boulevard raises $5m for Black community-focused neobank", "datetime": "2021-03-02 03:10:29", "image": "/finextra-images/top_pics/xl/firstboulevardfounders.jpg", "desc": "First Boulevard, a neobank focused on the Black community, has raised $5 million in a seed funding round joined by Barclays.Anthemis and angels such as Gabrielle Union, John Buttrick and Jamere Jackson joined the round for First Boulevard, which has set itself the goal of helping Black America build generational wealth. First Boulevard is one of several digital banks - including Tenth and Greenwood - that have emerged in recent months as The Black Lives Matter movement has led to a renewed focus on America's wealth gap and the financial services industry's role in it. Founded by serial entrepreneurs Donald Hawkins and Asya Bradley, the startup is building a platform that offers fee-free debit cards, financial education, a Black business marketplace which gives its members cashback for buying Black, and technology to help members automate their saving and wealth building goals. First Boulevard is a Visa Fintech Fast Track partner and was recently unveiled as the payment giant's partner for the first pilot of its new suite of crypto APIs, which will enable customers to purchase, custody and trade digital assets. Says Hawkins: \"History has proven that oppressed communities can succeed when their finances are centralized, and when it comes to financial services for the Black community, a centralizing force is long overdue. \"After viewing yet another tragedy engulf the Black community, and the all-too-familiar protests against persisting issues, it was beyond clear to me that the solutions Black America needs must be financially-focused and developed within our community.\"", "source": "Finextra"},
{"category": "payments", "article_link": "/newsarticle/37576/klarna-confirms-mammoth-1-billion-fund-raise", "title": "Klarna confirms mammoth $1 billion fund raise", "datetime": "2021-03-01 21:10:29", "image": "/finextra-images/top_pics/xl/klarna.jpg", "desc": "Buy now, pay later giant Klarna has confirmed a $1 billion funding round, valuing the Swedish firm at $31 billion.The 4x oversubscribed round included a combination of new and existing investors and makes Klarna the highest-valued private fintech in Europe and the second highest worldwide. The fresh capital injection comes just six month's after Klarna's last $650 million funding round, which gave it a $10.65 billion price tag. The new capital comes as the BNPL sector experiences a worldwide boom. Klarna reports that worldwide volume and revenue for 2020 grew 46% and 40% year-on-year to more than $53 billion and $1 billion respectively. The company says it intends to pledge one percent of the capital raised to a new initiative that addresses sustainability challenges around the world. Sebastian Siemiatkowski, co-founder and CEO of Klarna, states: \"I believe our industry has a responsibility to help in some way solve global sustainability issues and I hope others will join Klarna in our ambition.\"", "source": "Finextra"},
{"category": "retail", "article_link": "/newsarticle/37578/bbva-experiments-with-ai-to-summarise-customer-conversations", "title": "BBVA experiments with AI to summarise customer conversations", "datetime": "2021-03-02 08:10:30", "image": "/finextra-images/top_pics/xl/ai%20brain.jpg", "desc": "BBVA says it has had \"encouraging\" results testing an out-of-the-box AI language model to summarise Spanish customer conversations about banking.BBVA has been experimenting with an open API for GPT-3 (Generative Pre-trained Transformer 3), a language model from vendor OpenAI. The lender says it wanted to see if the technology could be useful in generating summaries of conversation with customers that can then be used by bank staff, saving them time and improving the user experience. BBVA used the model on ten unedited Spanish conversations about banking extracted from publicly available online forums. Without any previous fine-tuning, transfer-learning or retraining on the domain’s data, in most cases GPT-3 Davinci managed to generate summaries, identifying the core issue or question, the product or service involved, the recommendation or answer given and its state of completion. The accuracy is not \"very high,\" says BBVA but \"the results obtained are encouraging and suggest further exploration of the model’s value for the targeted tasks\".", "source": "Finextra"},
{"category": "retail", "article_link": "/newsarticle/37575/bank-of-ireland-to-close-a-third-of-branch-network", "title": "Bank of Ireland to close a third of branch network", "datetime": "2021-03-01 19:10:30", "image": "/finextra-images/top_pics/xl/bank-of-ireland-3.jpg", "desc": "The Bank of Ireland is to shut a third of its branches as it reaches a digital \"tipping point\" between online and offline transactions.The bank is to shutter 88 outlets in the Republic, reducing its network from 257 to 169, while in Northern Ireland the network will be reduced by 15 from 28 to 13. The move is expected to generate €26 billion in annualised cost savings. Francesca McDonagh, Bank of Ireland CEO, says: For many years, the trend to digital banking has been evident, with customers using branches less and less. Covid-19 has accelerated this changing behaviour, and we’ve seen a seismic shift towards digital banking over the past 12 months. We’ve now reached a tipping point in customer preferences between online and offline banking.\" She says 70% of customers are now digitally active, with a 26% increase in customers registering for the new mobile app since launch. The branch closure programme comes as part of a new three-year strategy to trim costs by €1.5 billion, entailing a reduction in 1400 full time roles achieved through voluntary redundancies. Up to 200 jobs will be impacted by the branch takedowns, which will mostly hit umanned outlets.", "source": "Finextra"},
{"category": "regulation", "article_link": "/newsarticle/37571/regulators-make-inquiries-over-robinhood-trading-restrictions", "title": "Regulators make inquiries over Robinhood trading restrictions", "datetime": "2021-02-26 00:00:00", "image": "/finextra-images/top_pics/xl/robinhood-for-web.png", "desc": "US regulators have made inquiries to Robinhood about the trading restrictions the app put on stocks such as GameStop during the Reddit-led rallies earlier this year.Robinhood temporarily stopped users from buying dozens of stocks that day traders who use the WallStreetBets subreddit had targeted in a short squeeze assault. In a regulatory filing, the firm says it has received \"inquiries\" about its actions from the SEC, Finra, a number of state attorneys general offices and several state securities regulators. Meanwhile, Robinhood says it is aware of around 46 putative class actions and three individual actions that have been filed against it. \"The complaints generally allege breach of contract, breach of the implied covenant of good faith and fair dealing, negligence, breach of fiduciary duty and other common law claims,\" says the filing, adding: \"We believe that the claims in these lawsuits are without merit and intend to defend against them vigorously.\"", "source": "Finextra"},
{"category": "inclusion", "article_link": "/newsarticle/37568/hsbc-launches-programme-to-help-customers-go-digital", "title": "HSBC launches programme to help customers go digital", "datetime": "2021-03-01 00:00:00", "image": "/finextra-images/top_pics/xl/5207.jpg", "desc": "As it closes branches and Covid-19 hastens the move to digital channels, HSBC has launched an education programme to help customers make the transition to online and mobile banking.The HSBC@Home programme is designed to educate and upskill customers on a range of topics from digital tools and services to fraud and financial fitness. The sessions are delivered through live virtual webinars and are hosted by specially trained branch staff. Last month the bank said it will close 82 branches in the UK this year as the Covid-19 pandemic accelerates the trend away from in-person banking and towards digital channels. Some 90% of all customer contact now taking place over the phone, internet or smartphone, while the bank has seen over 750,000 new mobile app registrations in the last 12 months. However, with some people - including older people - less comfortable with digital services, HSBC is contacting customers and inviting them to join HSBC@Home. Over 350 specialists across HSBC UK branches have received training to deliver the programme and the bank has held around 200 sessions for customers so far. Jackie Uhi, Uk head of network, HSBC, says: \"With many people embracing digital as their primary banking channel - some for the first time - we have developed HSBC@Home to help build confidence and enhance their digital skillset. \"The programme, which will be delivered across our UK branches, covers everything from how to register for our digital services and what you can do via the mobile app and online banking, to guarding yourself against fraud.”", "source": "Finextra"},
{"category": "sustainable", "article_link": "/newsarticle/37572/f10-and-new-energy-nexus-unite-to-nurture-green-fintech", "title": "F10 and New Energy Nexus unite to nurture green fintech", "datetime": "2021-03-01 00:00:00", "image": "/finextra-images/top_pics/xl/5f47c89f62822f163be93d8fbrainstorming.jpeg", "desc": "F10, fintech incubator and accelerator, will collaborate with New Energy Nexus to form the first global green and climate fintech program, bringing decarbonisation of financial services to the cutting edge of innovation. Against the backdrop of numerous corporate net-zero pledges, New Energy Nexus will support startup selection, mentorship, programming, networking and investment.  While new business models, new user experiences and new companies have been at the centre of the fintech industry, this partnership comes at a critical time and on the cusp of a similar, burgeoning wave in the sustainable finance or green fintech space.  Aaron McCreary, climate fintech lead at New Energy Nexus, highlights that this convergence could not come sooner.  “The intersection of digital financial technology and the climate emergency is real. Climate Fintech can help to make net-zero pathways and clean energy more accessible, measurable, and bankable. We’re thrilled to partner with F10 to help bring Climate Fintech innovations to market – enabling both individuals and corporates to save, spend, lend, and invest in ways which put the planet first.\"  The climate fintech program will accompany F10’s existing core curriculum and the Zurich, Singapore, Madrid and Barcelona based banking and insurance incubator will also extend its current open call for applicants.  The application window for F10 Zurich Incubation Batch VII will be extended from 26 February to 9 March 2021 for green and climate fintech, insurtech, regtech and deeptech startups.  Andreas Iten, co-founder of F10, adds: “There is immense potential and a strong use case for Green & Climate FinTechs in the market. Together with New Energy Nexus we can create the perfect environment for these cutting-edge startups to thrive and positively impact the global financial sector.”  Startups accepted into the program will benefit from:   Up to CHF 15,000 of expense coverage  Up to CHF 150,000 in funding  Fintech and climate accelerator curriculum and startup support services  Mentorship around subjects such as ESG, carbon and energy problem-solving  Exposure to corporates interested in startups dedicated to carbon neutrality and open innovation in the fintech space  A network of fintech and climate tech VC and angel investors   In conversation with Finextra in 2020, McCreary explored how the California-headquartered non-profit has been fostering entrepreneurs with thematic accelerator programmes across the world, while at the same time, supporting the Hewlett Foundation’s five-year climate strategy, running until 2023.  “Fintech has already shown its ability to disrupt the financial system, but what happens if you use fintech with the goal of reducing greenhouse gas emissions specifically,” McCreary stated. It remains to be seen, but it is evident that fintech startups have the potential for substantial impact at scale.  Read New Energy Nexus' report on ‘Climate Fintech: Mapping an Emerging Ecosystem of Climate Capital Catalysts’. ", "source": "Finextra"}
][
{"category": "sustainable", "article_link": "/newsarticle/37573/fintechs-role-in-paris-agreement-success-and-restoration-of-nature-at-scale", "title": "Fintech’s role in Paris Agreement success and restoration of nature at scale", "datetime": "2021-03-02 16:12:54", "image": "/finextra-images/top_pics/xl/sustainable-3.jpg", "desc": "According to the UNFCCC High-Level Climate Champions and the Marrakech Partnership Climate Action Pathways report published at the end of 2020, certain notable breakthroughs are moving key sectors closer to the 2050 zero emissions goal, in an attempt to avert the impact of climate change. The report outlines the milestones required for limiting the global temperature rise to 1.5°C as per the 2015 Paris Agreement in the areas of energy, cities and other human settlements, industry, land use, oceans and coastal zones, transport, water and resilience.  In turn, this will provide a blueprint to coordinate climate ambition among cities, regions, businesses and investors in the run up to the UN Climate Change Conference in Glasgow in November 2021.  With a view that the restoration of nature at scale is crucial for the success of the goals highlighted in the Paris Agreement, emerging fintech Cultivo plans to deploy $1 billion into restoring at least 3.5 million hectares of land within the next five years, calling upon investors to utilise nature to protect biodiversity and capture CO2.  Dr Manuel Pinuela, co-founder and CEO of Cultivo, highlights how “nature-based solutions can provide at least 30% of the CO2 mitigation goals by 2030, yet receive only around 3% of the funding allocated to carbon capture.”  As a result, the fintech firm is on a mission to fill this “financing gap”, pushing the importance of natural restoration, carbon sequestration, and biodiversity protection.  Cultivo does this with “an innovative financing mechanism that connects financial institutions to NGOs and landowners in order to unlock investment into natural capital opportunities that restore nature, protect livelihoods, and deliver healthy financial returns to investors.”  The fintech uses proprietary algorithms and remote sensor technologies to identify high quality projects and forecast the natural capital returns, pooling investment products and providing financial institutions with a simple way to invest in sustainable projects, such as regenerative grazing or planting trees.  These generate carbon credits and other offsets that can be sold, providing a return to investors and a long-term reliable income stream to the landowners and local communities. One successful example involves startup TerViva.  Cultivo and TerViva are helping farmers finance the cultivation of pongamia, a tree crop used for thousands of years in Asian cultures. Pongamia produces oilseeds that have similar properties to soy and requires fewer chemical inputs, fixes nitrogen to regenerate soils, and sequesters carbon in the form of woody biomass. The proven sustainability benefits of pongamia can then be translated into carbon credits – this in turn creates a new revenue stream for the farmers.  Dr Pinuela says that “while the pipeline of nature-based solutions is large, one of the painpoints that institutions and corporations have is that it is difficult to find high quality projects.”  Defining what he means by high quality, he continues to say that natural capital should create a flow of ecosystem services, or “the ability to capture carbon and maintain biodiversity.” A distressed asset like a degraded forest, grassland or wetland must be considered, as the tonnes of CO2 captured, number of species protected, or amount of water captured could be substantial.  Therefore, fintech startups like Cultivo work with NGOs to connect financial institutions and landowners so that they understand whether their land can be restored using data. In the same way that all businesses now have a corporate responsibility to fight climate change consistent with the Paris Accord, there is no excuse for financial institutions not utilising sustainable data.  Dr Pinuela takes this one step further and states that while there is no excuse when considering the abundance and granularity of data available, humans are also on a tight deadline to restore the planet.  Alongside this, incremental changes such as planting trees are being made, but as Dr Pinuela explains, other landscapes need to be considered in line with the economic impact on rural communities. ", "source": "Finextra"},
{"category": "retail", "article_link": "/newsarticle/37575/bank-of-ireland-to-close-a-third-of-branch-network", "title": "Bank of Ireland to close a third of branch network", "datetime": "2021-03-01 19:12:55", "image": "/finextra-images/top_pics/xl/bank-of-ireland-3.jpg", "desc": "The Bank of Ireland is to shut a third of its branches as it reaches a digital \"tipping point\" between online and offline transactions.The bank is to shutter 88 outlets in the Republic, reducing its network from 257 to 169, while in Northern Ireland the network will be reduced by 15 from 28 to 13. The move is expected to generate €26 billion in annualised cost savings. Francesca McDonagh, Bank of Ireland CEO, says: For many years, the trend to digital banking has been evident, with customers using branches less and less. Covid-19 has accelerated this changing behaviour, and we’ve seen a seismic shift towards digital banking over the past 12 months. We’ve now reached a tipping point in customer preferences between online and offline banking.\" She says 70% of customers are now digitally active, with a 26% increase in customers registering for the new mobile app since launch. The branch closure programme comes as part of a new three-year strategy to trim costs by €1.5 billion, entailing a reduction in 1400 full time roles achieved through voluntary redundancies. Up to 200 jobs will be impacted by the branch takedowns, which will mostly hit umanned outlets.", "source": "Finextra"},
{"category": "payments", "article_link": "/newsarticle/37576/klarna-confirms-mammoth-1-billion-fund-raise", "title": "Klarna confirms mammoth $1 billion fund raise", "datetime": "2021-03-01 21:12:56", "image": "/finextra-images/top_pics/xl/klarna.jpg", "desc": "Buy now, pay later giant Klarna has confirmed a $1 billion funding round, valuing the Swedish firm at $31 billion.The 4x oversubscribed round included a combination of new and existing investors and makes Klarna the highest-valued private fintech in Europe and the second highest worldwide. The fresh capital injection comes just six month's after Klarna's last $650 million funding round, which gave it a $10.65 billion price tag. The new capital comes as the BNPL sector experiences a worldwide boom. Klarna reports that worldwide volume and revenue for 2020 grew 46% and 40% year-on-year to more than $53 billion and $1 billion respectively. The company says it intends to pledge one percent of the capital raised to a new initiative that addresses sustainability challenges around the world. Sebastian Siemiatkowski, co-founder and CEO of Klarna, states: \"I believe our industry has a responsibility to help in some way solve global sustainability issues and I hope others will join Klarna in our ambition.\"", "source": "Finextra"},
{"category": "sustainable", "article_link": "/newsarticle/37572/f10-and-new-energy-nexus-unite-to-nurture-green-fintech", "title": "F10 and New Energy Nexus unite to nurture green fintech", "datetime": "2021-03-01 00:00:00", "image": "/finextra-images/top_pics/xl/5f47c89f62822f163be93d8fbrainstorming.jpeg", "desc": "F10, fintech incubator and accelerator, will collaborate with New Energy Nexus to form the first global green and climate fintech program, bringing decarbonisation of financial services to the cutting edge of innovation. Against the backdrop of numerous corporate net-zero pledges, New Energy Nexus will support startup selection, mentorship, programming, networking and investment.  While new business models, new user experiences and new companies have been at the centre of the fintech industry, this partnership comes at a critical time and on the cusp of a similar, burgeoning wave in the sustainable finance or green fintech space.  Aaron McCreary, climate fintech lead at New Energy Nexus, highlights that this convergence could not come sooner.  “The intersection of digital financial technology and the climate emergency is real. Climate Fintech can help to make net-zero pathways and clean energy more accessible, measurable, and bankable. We’re thrilled to partner with F10 to help bring Climate Fintech innovations to market – enabling both individuals and corporates to save, spend, lend, and invest in ways which put the planet first.\"  The climate fintech program will accompany F10’s existing core curriculum and the Zurich, Singapore, Madrid and Barcelona based banking and insurance incubator will also extend its current open call for applicants.  The application window for F10 Zurich Incubation Batch VII will be extended from 26 February to 9 March 2021 for green and climate fintech, insurtech, regtech and deeptech startups.  Andreas Iten, co-founder of F10, adds: “There is immense potential and a strong use case for Green & Climate FinTechs in the market. Together with New Energy Nexus we can create the perfect environment for these cutting-edge startups to thrive and positively impact the global financial sector.”  Startups accepted into the program will benefit from:   Up to CHF 15,000 of expense coverage  Up to CHF 150,000 in funding  Fintech and climate accelerator curriculum and startup support services  Mentorship around subjects such as ESG, carbon and energy problem-solving  Exposure to corporates interested in startups dedicated to carbon neutrality and open innovation in the fintech space  A network of fintech and climate tech VC and angel investors   In conversation with Finextra in 2020, McCreary explored how the California-headquartered non-profit has been fostering entrepreneurs with thematic accelerator programmes across the world, while at the same time, supporting the Hewlett Foundation’s five-year climate strategy, running until 2023.  “Fintech has already shown its ability to disrupt the financial system, but what happens if you use fintech with the goal of reducing greenhouse gas emissions specifically,” McCreary stated. It remains to be seen, but it is evident that fintech startups have the potential for substantial impact at scale.  Read New Energy Nexus' report on ‘Climate Fintech: Mapping an Emerging Ecosystem of Climate Capital Catalysts’. ", "source": "Finextra"},
{"category": "inclusion", "article_link": "/newsarticle/37580/first-boulevard-raises-5m-for-black-community-focused-neobank", "title": "First Boulevard raises $5m for Black community-focused neobank", "datetime": "2021-03-02 03:12:57", "image": "/finextra-images/top_pics/xl/firstboulevardfounders.jpg", "desc": "First Boulevard, a neobank focused on the Black community, has raised $5 million in a seed funding round joined by Barclays.Anthemis and angels such as Gabrielle Union, John Buttrick and Jamere Jackson joined the round for First Boulevard, which has set itself the goal of helping Black America build generational wealth. First Boulevard is one of several digital banks - including Tenth and Greenwood - that have emerged in recent months as The Black Lives Matter movement has led to a renewed focus on America's wealth gap and the financial services industry's role in it. Founded by serial entrepreneurs Donald Hawkins and Asya Bradley, the startup is building a platform that offers fee-free debit cards, financial education, a Black business marketplace which gives its members cashback for buying Black, and technology to help members automate their saving and wealth building goals. First Boulevard is a Visa Fintech Fast Track partner and was recently unveiled as the payment giant's partner for the first pilot of its new suite of crypto APIs, which will enable customers to purchase, custody and trade digital assets. Says Hawkins: \"History has proven that oppressed communities can succeed when their finances are centralized, and when it comes to financial services for the Black community, a centralizing force is long overdue. \"After viewing yet another tragedy engulf the Black community, and the all-too-familiar protests against persisting issues, it was beyond clear to me that the solutions Black America needs must be financially-focused and developed within our community.\"", "source": "Finextra"},
{"category": "regulation", "article_link": "/newsarticle/37571/regulators-make-inquiries-over-robinhood-trading-restrictions", "title": "Regulators make inquiries over Robinhood trading restrictions", "datetime": "2021-02-26 00:00:00", "image": "/finextra-images/top_pics/xl/robinhood-for-web.png", "desc": "US regulators have made inquiries to Robinhood about the trading restrictions the app put on stocks such as GameStop during the Reddit-led rallies earlier this year.Robinhood temporarily stopped users from buying dozens of stocks that day traders who use the WallStreetBets subreddit had targeted in a short squeeze assault. In a regulatory filing, the firm says it has received \"inquiries\" about its actions from the SEC, Finra, a number of state attorneys general offices and several state securities regulators. Meanwhile, Robinhood says it is aware of around 46 putative class actions and three individual actions that have been filed against it. \"The complaints generally allege breach of contract, breach of the implied covenant of good faith and fair dealing, negligence, breach of fiduciary duty and other common law claims,\" says the filing, adding: \"We believe that the claims in these lawsuits are without merit and intend to defend against them vigorously.\"", "source": "Finextra"},
{"category": "inclusion", "article_link": "/newsarticle/37568/hsbc-launches-programme-to-help-customers-go-digital", "title": "HSBC launches programme to help customers go digital", "datetime": "2021-03-01 00:00:00", "image": "/finextra-images/top_pics/xl/5207.jpg", "desc": "As it closes branches and Covid-19 hastens the move to digital channels, HSBC has launched an education programme to help customers make the transition to online and mobile banking.The HSBC@Home programme is designed to educate and upskill customers on a range of topics from digital tools and services to fraud and financial fitness. The sessions are delivered through live virtual webinars and are hosted by specially trained branch staff. Last month the bank said it will close 82 branches in the UK this year as the Covid-19 pandemic accelerates the trend away from in-person banking and towards digital channels. Some 90% of all customer contact now taking place over the phone, internet or smartphone, while the bank has seen over 750,000 new mobile app registrations in the last 12 months. However, with some people - including older people - less comfortable with digital services, HSBC is contacting customers and inviting them to join HSBC@Home. Over 350 specialists across HSBC UK branches have received training to deliver the programme and the bank has held around 200 sessions for customers so far. Jackie Uhi, Uk head of network, HSBC, says: \"With many people embracing digital as their primary banking channel - some for the first time - we have developed HSBC@Home to help build confidence and enhance their digital skillset. \"The programme, which will be delivered across our UK branches, covers everything from how to register for our digital services and what you can do via the mobile app and online banking, to guarding yourself against fraud.”", "source": "Finextra"},
{"category": "retail", "article_link": "/newsarticle/37578/bbva-experiments-with-ai-to-summarise-customer-conversations", "title": "BBVA experiments with AI to summarise customer conversations", "datetime": "2021-03-02 08:12:59", "image": "/finextra-images/top_pics/xl/ai%20brain.jpg", "desc": "BBVA says it has had \"encouraging\" results testing an out-of-the-box AI language model to summarise Spanish customer conversations about banking.BBVA has been experimenting with an open API for GPT-3 (Generative Pre-trained Transformer 3), a language model from vendor OpenAI. The lender says it wanted to see if the technology could be useful in generating summaries of conversation with customers that can then be used by bank staff, saving them time and improving the user experience. BBVA used the model on ten unedited Spanish conversations about banking extracted from publicly available online forums. Without any previous fine-tuning, transfer-learning or retraining on the domain’s data, in most cases GPT-3 Davinci managed to generate summaries, identifying the core issue or question, the product or service involved, the recommendation or answer given and its state of completion. The accuracy is not \"very high,\" says BBVA but \"the results obtained are encouraging and suggest further exploration of the model’s value for the targeted tasks\".", "source": "Finextra"},
{"category": "payments", "article_link": "/newsarticle/37579/facebook-and-google-eye-indian-digital-payment-network---economic-times", "title": "Facebook and Google eye Indian digital payment network - Economic Times", "datetime": "2021-03-02 00:13:00", "image": "/finextra-images/top_pics/xl/5443.jpg", "desc": "Facebook and Google are teaming up with Indian firms Infibeam and Reliance Industries on an application to set up a national digital payment network in the South Asian country, according to the Economic Times.The Reserve Bank of India has invited companies to create new umbrella entities (NUEs) that build payments networks that offer an alternative to the bank-owned not-for-profit National Payments Council of India. Citing sources, the Economic Times says that Google, Facebook, conglomerate Reliance and fintech firm Infibeam are at an advanced stage in submitting their plan to the central bank. Google and Facebook (through WhatsApp) are already significant players in the fast-growing Indian digital payments market. Another American giant, Amazon, is rumoured to have teamed up with ICICI Bank to explore its own NUE play. The Reserve Bank is expected to award two licences.", "source": "Finextra"}
][
{"category": "sustainable", "article_link": "/newsarticle/37573/fintechs-role-in-paris-agreement-success-and-restoration-of-nature-at-scale", "title": "Fintech’s role in Paris Agreement success and restoration of nature at scale", "datetime": "2021-03-02 16:16:01", "image": "/finextra-images/top_pics/xl/sustainable-3.jpg", "desc": "According to the UNFCCC High-Level Climate Champions and the Marrakech Partnership Climate Action Pathways report published at the end of 2020, certain notable breakthroughs are moving key sectors closer to the 2050 zero emissions goal, in an attempt to avert the impact of climate change. The report outlines the milestones required for limiting the global temperature rise to 1.5°C as per the 2015 Paris Agreement in the areas of energy, cities and other human settlements, industry, land use, oceans and coastal zones, transport, water and resilience.  In turn, this will provide a blueprint to coordinate climate ambition among cities, regions, businesses and investors in the run up to the UN Climate Change Conference in Glasgow in November 2021.  With a view that the restoration of nature at scale is crucial for the success of the goals highlighted in the Paris Agreement, emerging fintech Cultivo plans to deploy $1 billion into restoring at least 3.5 million hectares of land within the next five years, calling upon investors to utilise nature to protect biodiversity and capture CO2.  Dr Manuel Pinuela, co-founder and CEO of Cultivo, highlights how “nature-based solutions can provide at least 30% of the CO2 mitigation goals by 2030, yet receive only around 3% of the funding allocated to carbon capture.”  As a result, the fintech firm is on a mission to fill this “financing gap”, pushing the importance of natural restoration, carbon sequestration, and biodiversity protection.  Cultivo does this with “an innovative financing mechanism that connects financial institutions to NGOs and landowners in order to unlock investment into natural capital opportunities that restore nature, protect livelihoods, and deliver healthy financial returns to investors.”  The fintech uses proprietary algorithms and remote sensor technologies to identify high quality projects and forecast the natural capital returns, pooling investment products and providing financial institutions with a simple way to invest in sustainable projects, such as regenerative grazing or planting trees.  These generate carbon credits and other offsets that can be sold, providing a return to investors and a long-term reliable income stream to the landowners and local communities. One successful example involves startup TerViva.  Cultivo and TerViva are helping farmers finance the cultivation of pongamia, a tree crop used for thousands of years in Asian cultures. Pongamia produces oilseeds that have similar properties to soy and requires fewer chemical inputs, fixes nitrogen to regenerate soils, and sequesters carbon in the form of woody biomass. The proven sustainability benefits of pongamia can then be translated into carbon credits – this in turn creates a new revenue stream for the farmers.  Dr Pinuela says that “while the pipeline of nature-based solutions is large, one of the painpoints that institutions and corporations have is that it is difficult to find high quality projects.”  Defining what he means by high quality, he continues to say that natural capital should create a flow of ecosystem services, or “the ability to capture carbon and maintain biodiversity.” A distressed asset like a degraded forest, grassland or wetland must be considered, as the tonnes of CO2 captured, number of species protected, or amount of water captured could be substantial.  Therefore, fintech startups like Cultivo work with NGOs to connect financial institutions and landowners so that they understand whether their land can be restored using data. In the same way that all businesses now have a corporate responsibility to fight climate change consistent with the Paris Accord, there is no excuse for financial institutions not utilising sustainable data.  Dr Pinuela takes this one step further and states that while there is no excuse when considering the abundance and granularity of data available, humans are also on a tight deadline to restore the planet.  Alongside this, incremental changes such as planting trees are being made, but as Dr Pinuela explains, other landscapes need to be considered in line with the economic impact on rural communities. ", "source": "Finextra"},
{"category": "sustainable", "article_link": "/newsarticle/37572/f10-and-new-energy-nexus-unite-to-nurture-green-fintech", "title": "F10 and New Energy Nexus unite to nurture green fintech", "datetime": "2021-03-01 00:00:00", "image": "/finextra-images/top_pics/xl/5f47c89f62822f163be93d8fbrainstorming.jpeg", "desc": "F10, fintech incubator and accelerator, will collaborate with New Energy Nexus to form the first global green and climate fintech program, bringing decarbonisation of financial services to the cutting edge of innovation. Against the backdrop of numerous corporate net-zero pledges, New Energy Nexus will support startup selection, mentorship, programming, networking and investment.  While new business models, new user experiences and new companies have been at the centre of the fintech industry, this partnership comes at a critical time and on the cusp of a similar, burgeoning wave in the sustainable finance or green fintech space.  Aaron McCreary, climate fintech lead at New Energy Nexus, highlights that this convergence could not come sooner.  “The intersection of digital financial technology and the climate emergency is real. Climate Fintech can help to make net-zero pathways and clean energy more accessible, measurable, and bankable. We’re thrilled to partner with F10 to help bring Climate Fintech innovations to market – enabling both individuals and corporates to save, spend, lend, and invest in ways which put the planet first.\"  The climate fintech program will accompany F10’s existing core curriculum and the Zurich, Singapore, Madrid and Barcelona based banking and insurance incubator will also extend its current open call for applicants.  The application window for F10 Zurich Incubation Batch VII will be extended from 26 February to 9 March 2021 for green and climate fintech, insurtech, regtech and deeptech startups.  Andreas Iten, co-founder of F10, adds: “There is immense potential and a strong use case for Green & Climate FinTechs in the market. Together with New Energy Nexus we can create the perfect environment for these cutting-edge startups to thrive and positively impact the global financial sector.”  Startups accepted into the program will benefit from:   Up to CHF 15,000 of expense coverage  Up to CHF 150,000 in funding  Fintech and climate accelerator curriculum and startup support services  Mentorship around subjects such as ESG, carbon and energy problem-solving  Exposure to corporates interested in startups dedicated to carbon neutrality and open innovation in the fintech space  A network of fintech and climate tech VC and angel investors   In conversation with Finextra in 2020, McCreary explored how the California-headquartered non-profit has been fostering entrepreneurs with thematic accelerator programmes across the world, while at the same time, supporting the Hewlett Foundation’s five-year climate strategy, running until 2023.  “Fintech has already shown its ability to disrupt the financial system, but what happens if you use fintech with the goal of reducing greenhouse gas emissions specifically,” McCreary stated. It remains to be seen, but it is evident that fintech startups have the potential for substantial impact at scale.  Read New Energy Nexus' report on ‘Climate Fintech: Mapping an Emerging Ecosystem of Climate Capital Catalysts’. ", "source": "Finextra"},
{"category": "payments", "article_link": "/newsarticle/37576/klarna-confirms-mammoth-1-billion-fund-raise", "title": "Klarna confirms mammoth $1 billion fund raise", "datetime": "2021-03-01 21:16:02", "image": "/finextra-images/top_pics/xl/klarna.jpg", "desc": "Buy now, pay later giant Klarna has confirmed a $1 billion funding round, valuing the Swedish firm at $31 billion.The 4x oversubscribed round included a combination of new and existing investors and makes Klarna the highest-valued private fintech in Europe and the second highest worldwide. The fresh capital injection comes just six month's after Klarna's last $650 million funding round, which gave it a $10.65 billion price tag. The new capital comes as the BNPL sector experiences a worldwide boom. Klarna reports that worldwide volume and revenue for 2020 grew 46% and 40% year-on-year to more than $53 billion and $1 billion respectively. The company says it intends to pledge one percent of the capital raised to a new initiative that addresses sustainability challenges around the world. Sebastian Siemiatkowski, co-founder and CEO of Klarna, states: \"I believe our industry has a responsibility to help in some way solve global sustainability issues and I hope others will join Klarna in our ambition.\"", "source": "Finextra"},
{"category": "regulation", "article_link": "/newsarticle/37571/regulators-make-inquiries-over-robinhood-trading-restrictions", "title": "Regulators make inquiries over Robinhood trading restrictions", "datetime": "2021-02-26 00:00:00", "image": "/finextra-images/top_pics/xl/robinhood-for-web.png", "desc": "US regulators have made inquiries to Robinhood about the trading restrictions the app put on stocks such as GameStop during the Reddit-led rallies earlier this year.Robinhood temporarily stopped users from buying dozens of stocks that day traders who use the WallStreetBets subreddit had targeted in a short squeeze assault. In a regulatory filing, the firm says it has received \"inquiries\" about its actions from the SEC, Finra, a number of state attorneys general offices and several state securities regulators. Meanwhile, Robinhood says it is aware of around 46 putative class actions and three individual actions that have been filed against it. \"The complaints generally allege breach of contract, breach of the implied covenant of good faith and fair dealing, negligence, breach of fiduciary duty and other common law claims,\" says the filing, adding: \"We believe that the claims in these lawsuits are without merit and intend to defend against them vigorously.\"", "source": "Finextra"},
{"category": "retail", "article_link": "/newsarticle/37578/bbva-experiments-with-ai-to-summarise-customer-conversations", "title": "BBVA experiments with AI to summarise customer conversations", "datetime": "2021-03-02 08:16:04", "image": "/finextra-images/top_pics/xl/ai%20brain.jpg", "desc": "BBVA says it has had \"encouraging\" results testing an out-of-the-box AI language model to summarise Spanish customer conversations about banking.BBVA has been experimenting with an open API for GPT-3 (Generative Pre-trained Transformer 3), a language model from vendor OpenAI. The lender says it wanted to see if the technology could be useful in generating summaries of conversation with customers that can then be used by bank staff, saving them time and improving the user experience. BBVA used the model on ten unedited Spanish conversations about banking extracted from publicly available online forums. Without any previous fine-tuning, transfer-learning or retraining on the domain’s data, in most cases GPT-3 Davinci managed to generate summaries, identifying the core issue or question, the product or service involved, the recommendation or answer given and its state of completion. The accuracy is not \"very high,\" says BBVA but \"the results obtained are encouraging and suggest further exploration of the model’s value for the targeted tasks\".", "source": "Finextra"},
{"category": "payments", "article_link": "/newsarticle/37579/facebook-and-google-eye-indian-digital-payment-network---economic-times", "title": "Facebook and Google eye Indian digital payment network - Economic Times", "datetime": "2021-03-02 00:16:04", "image": "/finextra-images/top_pics/xl/5443.jpg", "desc": "Facebook and Google are teaming up with Indian firms Infibeam and Reliance Industries on an application to set up a national digital payment network in the South Asian country, according to the Economic Times.The Reserve Bank of India has invited companies to create new umbrella entities (NUEs) that build payments networks that offer an alternative to the bank-owned not-for-profit National Payments Council of India. Citing sources, the Economic Times says that Google, Facebook, conglomerate Reliance and fintech firm Infibeam are at an advanced stage in submitting their plan to the central bank. Google and Facebook (through WhatsApp) are already significant players in the fast-growing Indian digital payments market. Another American giant, Amazon, is rumoured to have teamed up with ICICI Bank to explore its own NUE play. The Reserve Bank is expected to award two licences.", "source": "Finextra"},
{"category": "inclusion", "article_link": "/newsarticle/37568/hsbc-launches-programme-to-help-customers-go-digital", "title": "HSBC launches programme to help customers go digital", "datetime": "2021-03-01 00:00:00", "image": "/finextra-images/top_pics/xl/5207.jpg", "desc": "As it closes branches and Covid-19 hastens the move to digital channels, HSBC has launched an education programme to help customers make the transition to online and mobile banking.The HSBC@Home programme is designed to educate and upskill customers on a range of topics from digital tools and services to fraud and financial fitness. The sessions are delivered through live virtual webinars and are hosted by specially trained branch staff. Last month the bank said it will close 82 branches in the UK this year as the Covid-19 pandemic accelerates the trend away from in-person banking and towards digital channels. Some 90% of all customer contact now taking place over the phone, internet or smartphone, while the bank has seen over 750,000 new mobile app registrations in the last 12 months. However, with some people - including older people - less comfortable with digital services, HSBC is contacting customers and inviting them to join HSBC@Home. Over 350 specialists across HSBC UK branches have received training to deliver the programme and the bank has held around 200 sessions for customers so far. Jackie Uhi, Uk head of network, HSBC, says: \"With many people embracing digital as their primary banking channel - some for the first time - we have developed HSBC@Home to help build confidence and enhance their digital skillset. \"The programme, which will be delivered across our UK branches, covers everything from how to register for our digital services and what you can do via the mobile app and online banking, to guarding yourself against fraud.”", "source": "Finextra"},
{"category": "retail", "article_link": "/newsarticle/37575/bank-of-ireland-to-close-a-third-of-branch-network", "title": "Bank of Ireland to close a third of branch network", "datetime": "2021-03-01 19:16:06", "image": "/finextra-images/top_pics/xl/bank-of-ireland-3.jpg", "desc": "The Bank of Ireland is to shut a third of its branches as it reaches a digital \"tipping point\" between online and offline transactions.The bank is to shutter 88 outlets in the Republic, reducing its network from 257 to 169, while in Northern Ireland the network will be reduced by 15 from 28 to 13. The move is expected to generate €26 billion in annualised cost savings. Francesca McDonagh, Bank of Ireland CEO, says: For many years, the trend to digital banking has been evident, with customers using branches less and less. Covid-19 has accelerated this changing behaviour, and we’ve seen a seismic shift towards digital banking over the past 12 months. We’ve now reached a tipping point in customer preferences between online and offline banking.\" She says 70% of customers are now digitally active, with a 26% increase in customers registering for the new mobile app since launch. The branch closure programme comes as part of a new three-year strategy to trim costs by €1.5 billion, entailing a reduction in 1400 full time roles achieved through voluntary redundancies. Up to 200 jobs will be impacted by the branch takedowns, which will mostly hit umanned outlets.", "source": "Finextra"},
{"category": "inclusion", "article_link": "/newsarticle/37580/first-boulevard-raises-5m-for-black-community-focused-neobank", "title": "First Boulevard raises $5m for Black community-focused neobank", "datetime": "2021-03-02 03:16:06", "image": "/finextra-images/top_pics/xl/firstboulevardfounders.jpg", "desc": "First Boulevard, a neobank focused on the Black community, has raised $5 million in a seed funding round joined by Barclays.Anthemis and angels such as Gabrielle Union, John Buttrick and Jamere Jackson joined the round for First Boulevard, which has set itself the goal of helping Black America build generational wealth. First Boulevard is one of several digital banks - including Tenth and Greenwood - that have emerged in recent months as The Black Lives Matter movement has led to a renewed focus on America's wealth gap and the financial services industry's role in it. Founded by serial entrepreneurs Donald Hawkins and Asya Bradley, the startup is building a platform that offers fee-free debit cards, financial education, a Black business marketplace which gives its members cashback for buying Black, and technology to help members automate their saving and wealth building goals. First Boulevard is a Visa Fintech Fast Track partner and was recently unveiled as the payment giant's partner for the first pilot of its new suite of crypto APIs, which will enable customers to purchase, custody and trade digital assets. Says Hawkins: \"History has proven that oppressed communities can succeed when their finances are centralized, and when it comes to financial services for the Black community, a centralizing force is long overdue. \"After viewing yet another tragedy engulf the Black community, and the all-too-familiar protests against persisting issues, it was beyond clear to me that the solutions Black America needs must be financially-focused and developed within our community.\"", "source": "Finextra"}
][
{"category": "regulation", "article_link": "/newsarticle/37571/regulators-make-inquiries-over-robinhood-trading-restrictions", "title": "Regulators make inquiries over Robinhood trading restrictions", "datetime": "2021-02-26 00:00:00", "image": "/finextra-images/top_pics/xl/robinhood-for-web.png", "desc": "US regulators have made inquiries to Robinhood about the trading restrictions the app put on stocks such as GameStop during the Reddit-led rallies earlier this year.Robinhood temporarily stopped users from buying dozens of stocks that day traders who use the WallStreetBets subreddit had targeted in a short squeeze assault. In a regulatory filing, the firm says it has received \"inquiries\" about its actions from the SEC, Finra, a number of state attorneys general offices and several state securities regulators. Meanwhile, Robinhood says it is aware of around 46 putative class actions and three individual actions that have been filed against it. \"The complaints generally allege breach of contract, breach of the implied covenant of good faith and fair dealing, negligence, breach of fiduciary duty and other common law claims,\" says the filing, adding: \"We believe that the claims in these lawsuits are without merit and intend to defend against them vigorously.\"", "source": "Finextra"},
{"category": "payments", "article_link": "/newsarticle/37579/facebook-and-google-eye-indian-digital-payment-network---economic-times", "title": "Facebook and Google eye Indian digital payment network - Economic Times", "datetime": "2021-03-02 00:16:22", "image": "/finextra-images/top_pics/xl/5443.jpg", "desc": "Facebook and Google are teaming up with Indian firms Infibeam and Reliance Industries on an application to set up a national digital payment network in the South Asian country, according to the Economic Times.The Reserve Bank of India has invited companies to create new umbrella entities (NUEs) that build payments networks that offer an alternative to the bank-owned not-for-profit National Payments Council of India. Citing sources, the Economic Times says that Google, Facebook, conglomerate Reliance and fintech firm Infibeam are at an advanced stage in submitting their plan to the central bank. Google and Facebook (through WhatsApp) are already significant players in the fast-growing Indian digital payments market. Another American giant, Amazon, is rumoured to have teamed up with ICICI Bank to explore its own NUE play. The Reserve Bank is expected to award two licences.", "source": "Finextra"},
{"category": "payments", "article_link": "/newsarticle/37576/klarna-confirms-mammoth-1-billion-fund-raise", "title": "Klarna confirms mammoth $1 billion fund raise", "datetime": "2021-03-01 20:16:22", "image": "/finextra-images/top_pics/xl/klarna.jpg", "desc": "Buy now, pay later giant Klarna has confirmed a $1 billion funding round, valuing the Swedish firm at $31 billion.The 4x oversubscribed round included a combination of new and existing investors and makes Klarna the highest-valued private fintech in Europe and the second highest worldwide. The fresh capital injection comes just six month's after Klarna's last $650 million funding round, which gave it a $10.65 billion price tag. The new capital comes as the BNPL sector experiences a worldwide boom. Klarna reports that worldwide volume and revenue for 2020 grew 46% and 40% year-on-year to more than $53 billion and $1 billion respectively. The company says it intends to pledge one percent of the capital raised to a new initiative that addresses sustainability challenges around the world. Sebastian Siemiatkowski, co-founder and CEO of Klarna, states: \"I believe our industry has a responsibility to help in some way solve global sustainability issues and I hope others will join Klarna in our ambition.\"", "source": "Finextra"},
{"category": "sustainable", "article_link": "/newsarticle/37572/f10-and-new-energy-nexus-unite-to-nurture-green-fintech", "title": "F10 and New Energy Nexus unite to nurture green fintech", "datetime": "2021-03-01 00:00:00", "image": "/finextra-images/top_pics/xl/5f47c89f62822f163be93d8fbrainstorming.jpeg", "desc": "F10, fintech incubator and accelerator, will collaborate with New Energy Nexus to form the first global green and climate fintech program, bringing decarbonisation of financial services to the cutting edge of innovation. Against the backdrop of numerous corporate net-zero pledges, New Energy Nexus will support startup selection, mentorship, programming, networking and investment.  While new business models, new user experiences and new companies have been at the centre of the fintech industry, this partnership comes at a critical time and on the cusp of a similar, burgeoning wave in the sustainable finance or green fintech space.  Aaron McCreary, climate fintech lead at New Energy Nexus, highlights that this convergence could not come sooner.  “The intersection of digital financial technology and the climate emergency is real. Climate Fintech can help to make net-zero pathways and clean energy more accessible, measurable, and bankable. We’re thrilled to partner with F10 to help bring Climate Fintech innovations to market – enabling both individuals and corporates to save, spend, lend, and invest in ways which put the planet first.\"  The climate fintech program will accompany F10’s existing core curriculum and the Zurich, Singapore, Madrid and Barcelona based banking and insurance incubator will also extend its current open call for applicants.  The application window for F10 Zurich Incubation Batch VII will be extended from 26 February to 9 March 2021 for green and climate fintech, insurtech, regtech and deeptech startups.  Andreas Iten, co-founder of F10, adds: “There is immense potential and a strong use case for Green & Climate FinTechs in the market. Together with New Energy Nexus we can create the perfect environment for these cutting-edge startups to thrive and positively impact the global financial sector.”  Startups accepted into the program will benefit from:   Up to CHF 15,000 of expense coverage  Up to CHF 150,000 in funding  Fintech and climate accelerator curriculum and startup support services  Mentorship around subjects such as ESG, carbon and energy problem-solving  Exposure to corporates interested in startups dedicated to carbon neutrality and open innovation in the fintech space  A network of fintech and climate tech VC and angel investors   In conversation with Finextra in 2020, McCreary explored how the California-headquartered non-profit has been fostering entrepreneurs with thematic accelerator programmes across the world, while at the same time, supporting the Hewlett Foundation’s five-year climate strategy, running until 2023.  “Fintech has already shown its ability to disrupt the financial system, but what happens if you use fintech with the goal of reducing greenhouse gas emissions specifically,” McCreary stated. It remains to be seen, but it is evident that fintech startups have the potential for substantial impact at scale.  Read New Energy Nexus' report on ‘Climate Fintech: Mapping an Emerging Ecosystem of Climate Capital Catalysts’. ", "source": "Finextra"},
{"category": "retail", "article_link": "/newsarticle/37575/bank-of-ireland-to-close-a-third-of-branch-network", "title": "Bank of Ireland to close a third of branch network", "datetime": "2021-03-01 19:16:24", "image": "/finextra-images/top_pics/xl/bank-of-ireland-3.jpg", "desc": "The Bank of Ireland is to shut a third of its branches as it reaches a digital \"tipping point\" between online and offline transactions.The bank is to shutter 88 outlets in the Republic, reducing its network from 257 to 169, while in Northern Ireland the network will be reduced by 15 from 28 to 13. The move is expected to generate €26 billion in annualised cost savings. Francesca McDonagh, Bank of Ireland CEO, says: For many years, the trend to digital banking has been evident, with customers using branches less and less. Covid-19 has accelerated this changing behaviour, and we’ve seen a seismic shift towards digital banking over the past 12 months. We’ve now reached a tipping point in customer preferences between online and offline banking.\" She says 70% of customers are now digitally active, with a 26% increase in customers registering for the new mobile app since launch. The branch closure programme comes as part of a new three-year strategy to trim costs by €1.5 billion, entailing a reduction in 1400 full time roles achieved through voluntary redundancies. Up to 200 jobs will be impacted by the branch takedowns, which will mostly hit umanned outlets.", "source": "Finextra"},
{"category": "sustainable", "article_link": "/newsarticle/37573/fintechs-role-in-paris-agreement-success-and-restoration-of-nature-at-scale", "title": "Fintech’s role in Paris Agreement success and restoration of nature at scale", "datetime": "2021-03-02 16:16:25", "image": "/finextra-images/top_pics/xl/sustainable-3.jpg", "desc": "According to the UNFCCC High-Level Climate Champions and the Marrakech Partnership Climate Action Pathways report published at the end of 2020, certain notable breakthroughs are moving key sectors closer to the 2050 zero emissions goal, in an attempt to avert the impact of climate change. The report outlines the milestones required for limiting the global temperature rise to 1.5°C as per the 2015 Paris Agreement in the areas of energy, cities and other human settlements, industry, land use, oceans and coastal zones, transport, water and resilience.  In turn, this will provide a blueprint to coordinate climate ambition among cities, regions, businesses and investors in the run up to the UN Climate Change Conference in Glasgow in November 2021.  With a view that the restoration of nature at scale is crucial for the success of the goals highlighted in the Paris Agreement, emerging fintech Cultivo plans to deploy $1 billion into restoring at least 3.5 million hectares of land within the next five years, calling upon investors to utilise nature to protect biodiversity and capture CO2.  Dr Manuel Pinuela, co-founder and CEO of Cultivo, highlights how “nature-based solutions can provide at least 30% of the CO2 mitigation goals by 2030, yet receive only around 3% of the funding allocated to carbon capture.”  As a result, the fintech firm is on a mission to fill this “financing gap”, pushing the importance of natural restoration, carbon sequestration, and biodiversity protection.  Cultivo does this with “an innovative financing mechanism that connects financial institutions to NGOs and landowners in order to unlock investment into natural capital opportunities that restore nature, protect livelihoods, and deliver healthy financial returns to investors.”  The fintech uses proprietary algorithms and remote sensor technologies to identify high quality projects and forecast the natural capital returns, pooling investment products and providing financial institutions with a simple way to invest in sustainable projects, such as regenerative grazing or planting trees.  These generate carbon credits and other offsets that can be sold, providing a return to investors and a long-term reliable income stream to the landowners and local communities. One successful example involves startup TerViva.  Cultivo and TerViva are helping farmers finance the cultivation of pongamia, a tree crop used for thousands of years in Asian cultures. Pongamia produces oilseeds that have similar properties to soy and requires fewer chemical inputs, fixes nitrogen to regenerate soils, and sequesters carbon in the form of woody biomass. The proven sustainability benefits of pongamia can then be translated into carbon credits – this in turn creates a new revenue stream for the farmers.  Dr Pinuela says that “while the pipeline of nature-based solutions is large, one of the painpoints that institutions and corporations have is that it is difficult to find high quality projects.”  Defining what he means by high quality, he continues to say that natural capital should create a flow of ecosystem services, or “the ability to capture carbon and maintain biodiversity.” A distressed asset like a degraded forest, grassland or wetland must be considered, as the tonnes of CO2 captured, number of species protected, or amount of water captured could be substantial.  Therefore, fintech startups like Cultivo work with NGOs to connect financial institutions and landowners so that they understand whether their land can be restored using data. In the same way that all businesses now have a corporate responsibility to fight climate change consistent with the Paris Accord, there is no excuse for financial institutions not utilising sustainable data.  Dr Pinuela takes this one step further and states that while there is no excuse when considering the abundance and granularity of data available, humans are also on a tight deadline to restore the planet.  Alongside this, incremental changes such as planting trees are being made, but as Dr Pinuela explains, other landscapes need to be considered in line with the economic impact on rural communities. ", "source": "Finextra"},
{"category": "inclusion", "article_link": "/newsarticle/37568/hsbc-launches-programme-to-help-customers-go-digital", "title": "HSBC launches programme to help customers go digital", "datetime": "2021-03-01 00:00:00", "image": "/finextra-images/top_pics/xl/5207.jpg", "desc": "As it closes branches and Covid-19 hastens the move to digital channels, HSBC has launched an education programme to help customers make the transition to online and mobile banking.The HSBC@Home programme is designed to educate and upskill customers on a range of topics from digital tools and services to fraud and financial fitness. The sessions are delivered through live virtual webinars and are hosted by specially trained branch staff. Last month the bank said it will close 82 branches in the UK this year as the Covid-19 pandemic accelerates the trend away from in-person banking and towards digital channels. Some 90% of all customer contact now taking place over the phone, internet or smartphone, while the bank has seen over 750,000 new mobile app registrations in the last 12 months. However, with some people - including older people - less comfortable with digital services, HSBC is contacting customers and inviting them to join HSBC@Home. Over 350 specialists across HSBC UK branches have received training to deliver the programme and the bank has held around 200 sessions for customers so far. Jackie Uhi, Uk head of network, HSBC, says: \"With many people embracing digital as their primary banking channel - some for the first time - we have developed HSBC@Home to help build confidence and enhance their digital skillset. \"The programme, which will be delivered across our UK branches, covers everything from how to register for our digital services and what you can do via the mobile app and online banking, to guarding yourself against fraud.”", "source": "Finextra"},
{"category": "retail", "article_link": "/newsarticle/37578/bbva-experiments-with-ai-to-summarise-customer-conversations", "title": "BBVA experiments with AI to summarise customer conversations", "datetime": "2021-03-02 08:16:26", "image": "/finextra-images/top_pics/xl/ai%20brain.jpg", "desc": "BBVA says it has had \"encouraging\" results testing an out-of-the-box AI language model to summarise Spanish customer conversations about banking.BBVA has been experimenting with an open API for GPT-3 (Generative Pre-trained Transformer 3), a language model from vendor OpenAI. The lender says it wanted to see if the technology could be useful in generating summaries of conversation with customers that can then be used by bank staff, saving them time and improving the user experience. BBVA used the model on ten unedited Spanish conversations about banking extracted from publicly available online forums. Without any previous fine-tuning, transfer-learning or retraining on the domain’s data, in most cases GPT-3 Davinci managed to generate summaries, identifying the core issue or question, the product or service involved, the recommendation or answer given and its state of completion. The accuracy is not \"very high,\" says BBVA but \"the results obtained are encouraging and suggest further exploration of the model’s value for the targeted tasks\".", "source": "Finextra"},
{"category": "inclusion", "article_link": "/newsarticle/37580/first-boulevard-raises-5m-for-black-community-focused-neobank", "title": "First Boulevard raises $5m for Black community-focused neobank", "datetime": "2021-03-02 03:16:26", "image": "/finextra-images/top_pics/xl/firstboulevardfounders.jpg", "desc": "First Boulevard, a neobank focused on the Black community, has raised $5 million in a seed funding round joined by Barclays.Anthemis and angels such as Gabrielle Union, John Buttrick and Jamere Jackson joined the round for First Boulevard, which has set itself the goal of helping Black America build generational wealth. First Boulevard is one of several digital banks - including Tenth and Greenwood - that have emerged in recent months as The Black Lives Matter movement has led to a renewed focus on America's wealth gap and the financial services industry's role in it. Founded by serial entrepreneurs Donald Hawkins and Asya Bradley, the startup is building a platform that offers fee-free debit cards, financial education, a Black business marketplace which gives its members cashback for buying Black, and technology to help members automate their saving and wealth building goals. First Boulevard is a Visa Fintech Fast Track partner and was recently unveiled as the payment giant's partner for the first pilot of its new suite of crypto APIs, which will enable customers to purchase, custody and trade digital assets. Says Hawkins: \"History has proven that oppressed communities can succeed when their finances are centralized, and when it comes to financial services for the Black community, a centralizing force is long overdue. \"After viewing yet another tragedy engulf the Black community, and the all-too-familiar protests against persisting issues, it was beyond clear to me that the solutions Black America needs must be financially-focused and developed within our community.\"", "source": "Finextra"}
][
{"category": "inclusion", "article_link": "/newsarticle/37580/first-boulevard-raises-5m-for-black-community-focused-neobank", "title": "First Boulevard raises $5m for Black community-focused neobank", "datetime": "2021-03-02 03:24:59", "image": "/finextra-images/top_pics/xl/firstboulevardfounders.jpg", "desc": "First Boulevard, a neobank focused on the Black community, has raised $5 million in a seed funding round joined by Barclays.Anthemis and angels such as Gabrielle Union, John Buttrick and Jamere Jackson joined the round for First Boulevard, which has set itself the goal of helping Black America build generational wealth. First Boulevard is one of several digital banks - including Tenth and Greenwood - that have emerged in recent months as The Black Lives Matter movement has led to a renewed focus on America's wealth gap and the financial services industry's role in it. Founded by serial entrepreneurs Donald Hawkins and Asya Bradley, the startup is building a platform that offers fee-free debit cards, financial education, a Black business marketplace which gives its members cashback for buying Black, and technology to help members automate their saving and wealth building goals. First Boulevard is a Visa Fintech Fast Track partner and was recently unveiled as the payment giant's partner for the first pilot of its new suite of crypto APIs, which will enable customers to purchase, custody and trade digital assets. Says Hawkins: \"History has proven that oppressed communities can succeed when their finances are centralized, and when it comes to financial services for the Black community, a centralizing force is long overdue. \"After viewing yet another tragedy engulf the Black community, and the all-too-familiar protests against persisting issues, it was beyond clear to me that the solutions Black America needs must be financially-focused and developed within our community.\"", "source": "Finextra"},
{"category": "retail", "article_link": "/newsarticle/37578/bbva-experiments-with-ai-to-summarise-customer-conversations", "title": "BBVA experiments with AI to summarise customer conversations", "datetime": "2021-03-02 08:25:00", "image": "/finextra-images/top_pics/xl/ai%20brain.jpg", "desc": "BBVA says it has had \"encouraging\" results testing an out-of-the-box AI language model to summarise Spanish customer conversations about banking.BBVA has been experimenting with an open API for GPT-3 (Generative Pre-trained Transformer 3), a language model from vendor OpenAI. The lender says it wanted to see if the technology could be useful in generating summaries of conversation with customers that can then be used by bank staff, saving them time and improving the user experience. BBVA used the model on ten unedited Spanish conversations about banking extracted from publicly available online forums. Without any previous fine-tuning, transfer-learning or retraining on the domain’s data, in most cases GPT-3 Davinci managed to generate summaries, identifying the core issue or question, the product or service involved, the recommendation or answer given and its state of completion. The accuracy is not \"very high,\" says BBVA but \"the results obtained are encouraging and suggest further exploration of the model’s value for the targeted tasks\".", "source": "Finextra"},
{"category": "sustainable", "article_link": "/newsarticle/37573/fintechs-role-in-paris-agreement-success-and-restoration-of-nature-at-scale", "title": "Fintech’s role in Paris Agreement success and restoration of nature at scale", "datetime": "2021-03-02 16:25:00", "image": "/finextra-images/top_pics/xl/sustainable-3.jpg", "desc": "According to the UNFCCC High-Level Climate Champions and the Marrakech Partnership Climate Action Pathways report published at the end of 2020, certain notable breakthroughs are moving key sectors closer to the 2050 zero emissions goal, in an attempt to avert the impact of climate change. The report outlines the milestones required for limiting the global temperature rise to 1.5°C as per the 2015 Paris Agreement in the areas of energy, cities and other human settlements, industry, land use, oceans and coastal zones, transport, water and resilience.  In turn, this will provide a blueprint to coordinate climate ambition among cities, regions, businesses and investors in the run up to the UN Climate Change Conference in Glasgow in November 2021.  With a view that the restoration of nature at scale is crucial for the success of the goals highlighted in the Paris Agreement, emerging fintech Cultivo plans to deploy $1 billion into restoring at least 3.5 million hectares of land within the next five years, calling upon investors to utilise nature to protect biodiversity and capture CO2.  Dr Manuel Pinuela, co-founder and CEO of Cultivo, highlights how “nature-based solutions can provide at least 30% of the CO2 mitigation goals by 2030, yet receive only around 3% of the funding allocated to carbon capture.”  As a result, the fintech firm is on a mission to fill this “financing gap”, pushing the importance of natural restoration, carbon sequestration, and biodiversity protection.  Cultivo does this with “an innovative financing mechanism that connects financial institutions to NGOs and landowners in order to unlock investment into natural capital opportunities that restore nature, protect livelihoods, and deliver healthy financial returns to investors.”  The fintech uses proprietary algorithms and remote sensor technologies to identify high quality projects and forecast the natural capital returns, pooling investment products and providing financial institutions with a simple way to invest in sustainable projects, such as regenerative grazing or planting trees.  These generate carbon credits and other offsets that can be sold, providing a return to investors and a long-term reliable income stream to the landowners and local communities. One successful example involves startup TerViva.  Cultivo and TerViva are helping farmers finance the cultivation of pongamia, a tree crop used for thousands of years in Asian cultures. Pongamia produces oilseeds that have similar properties to soy and requires fewer chemical inputs, fixes nitrogen to regenerate soils, and sequesters carbon in the form of woody biomass. The proven sustainability benefits of pongamia can then be translated into carbon credits – this in turn creates a new revenue stream for the farmers.  Dr Pinuela says that “while the pipeline of nature-based solutions is large, one of the painpoints that institutions and corporations have is that it is difficult to find high quality projects.”  Defining what he means by high quality, he continues to say that natural capital should create a flow of ecosystem services, or “the ability to capture carbon and maintain biodiversity.” A distressed asset like a degraded forest, grassland or wetland must be considered, as the tonnes of CO2 captured, number of species protected, or amount of water captured could be substantial.  Therefore, fintech startups like Cultivo work with NGOs to connect financial institutions and landowners so that they understand whether their land can be restored using data. In the same way that all businesses now have a corporate responsibility to fight climate change consistent with the Paris Accord, there is no excuse for financial institutions not utilising sustainable data.  Dr Pinuela takes this one step further and states that while there is no excuse when considering the abundance and granularity of data available, humans are also on a tight deadline to restore the planet.  Alongside this, incremental changes such as planting trees are being made, but as Dr Pinuela explains, other landscapes need to be considered in line with the economic impact on rural communities. ", "source": "Finextra"},
{"category": "inclusion", "article_link": "/newsarticle/37568/hsbc-launches-programme-to-help-customers-go-digital", "title": "HSBC launches programme to help customers go digital", "datetime": "2021-03-01 00:00:00", "image": "/finextra-images/top_pics/xl/5207.jpg", "desc": "As it closes branches and Covid-19 hastens the move to digital channels, HSBC has launched an education programme to help customers make the transition to online and mobile banking.The HSBC@Home programme is designed to educate and upskill customers on a range of topics from digital tools and services to fraud and financial fitness. The sessions are delivered through live virtual webinars and are hosted by specially trained branch staff. Last month the bank said it will close 82 branches in the UK this year as the Covid-19 pandemic accelerates the trend away from in-person banking and towards digital channels. Some 90% of all customer contact now taking place over the phone, internet or smartphone, while the bank has seen over 750,000 new mobile app registrations in the last 12 months. However, with some people - including older people - less comfortable with digital services, HSBC is contacting customers and inviting them to join HSBC@Home. Over 350 specialists across HSBC UK branches have received training to deliver the programme and the bank has held around 200 sessions for customers so far. Jackie Uhi, Uk head of network, HSBC, says: \"With many people embracing digital as their primary banking channel - some for the first time - we have developed HSBC@Home to help build confidence and enhance their digital skillset. \"The programme, which will be delivered across our UK branches, covers everything from how to register for our digital services and what you can do via the mobile app and online banking, to guarding yourself against fraud.”", "source": "Finextra"},
{"category": "payments", "article_link": "/newsarticle/37579/facebook-and-google-eye-indian-digital-payment-network---economic-times", "title": "Facebook and Google eye Indian digital payment network - Economic Times", "datetime": "2021-03-02 00:25:01", "image": "/finextra-images/top_pics/xl/5443.jpg", "desc": "Facebook and Google are teaming up with Indian firms Infibeam and Reliance Industries on an application to set up a national digital payment network in the South Asian country, according to the Economic Times.The Reserve Bank of India has invited companies to create new umbrella entities (NUEs) that build payments networks that offer an alternative to the bank-owned not-for-profit National Payments Council of India. Citing sources, the Economic Times says that Google, Facebook, conglomerate Reliance and fintech firm Infibeam are at an advanced stage in submitting their plan to the central bank. Google and Facebook (through WhatsApp) are already significant players in the fast-growing Indian digital payments market. Another American giant, Amazon, is rumoured to have teamed up with ICICI Bank to explore its own NUE play. The Reserve Bank is expected to award two licences.", "source": "Finextra"},
{"category": "payments", "article_link": "/newsarticle/37576/klarna-confirms-mammoth-1-billion-fund-raise", "title": "Klarna confirms mammoth $1 billion fund raise", "datetime": "2021-03-01 20:25:02", "image": "/finextra-images/top_pics/xl/klarna.jpg", "desc": "Buy now, pay later giant Klarna has confirmed a $1 billion funding round, valuing the Swedish firm at $31 billion.The 4x oversubscribed round included a combination of new and existing investors and makes Klarna the highest-valued private fintech in Europe and the second highest worldwide. The fresh capital injection comes just six month's after Klarna's last $650 million funding round, which gave it a $10.65 billion price tag. The new capital comes as the BNPL sector experiences a worldwide boom. Klarna reports that worldwide volume and revenue for 2020 grew 46% and 40% year-on-year to more than $53 billion and $1 billion respectively. The company says it intends to pledge one percent of the capital raised to a new initiative that addresses sustainability challenges around the world. Sebastian Siemiatkowski, co-founder and CEO of Klarna, states: \"I believe our industry has a responsibility to help in some way solve global sustainability issues and I hope others will join Klarna in our ambition.\"", "source": "Finextra"},
{"category": "sustainable", "article_link": "/newsarticle/37572/f10-and-new-energy-nexus-unite-to-nurture-green-fintech", "title": "F10 and New Energy Nexus unite to nurture green fintech", "datetime": "2021-03-01 00:00:00", "image": "/finextra-images/top_pics/xl/5f47c89f62822f163be93d8fbrainstorming.jpeg", "desc": "F10, fintech incubator and accelerator, will collaborate with New Energy Nexus to form the first global green and climate fintech program, bringing decarbonisation of financial services to the cutting edge of innovation. Against the backdrop of numerous corporate net-zero pledges, New Energy Nexus will support startup selection, mentorship, programming, networking and investment.  While new business models, new user experiences and new companies have been at the centre of the fintech industry, this partnership comes at a critical time and on the cusp of a similar, burgeoning wave in the sustainable finance or green fintech space.  Aaron McCreary, climate fintech lead at New Energy Nexus, highlights that this convergence could not come sooner.  “The intersection of digital financial technology and the climate emergency is real. Climate Fintech can help to make net-zero pathways and clean energy more accessible, measurable, and bankable. We’re thrilled to partner with F10 to help bring Climate Fintech innovations to market – enabling both individuals and corporates to save, spend, lend, and invest in ways which put the planet first.\"  The climate fintech program will accompany F10’s existing core curriculum and the Zurich, Singapore, Madrid and Barcelona based banking and insurance incubator will also extend its current open call for applicants.  The application window for F10 Zurich Incubation Batch VII will be extended from 26 February to 9 March 2021 for green and climate fintech, insurtech, regtech and deeptech startups.  Andreas Iten, co-founder of F10, adds: “There is immense potential and a strong use case for Green & Climate FinTechs in the market. Together with New Energy Nexus we can create the perfect environment for these cutting-edge startups to thrive and positively impact the global financial sector.”  Startups accepted into the program will benefit from:   Up to CHF 15,000 of expense coverage  Up to CHF 150,000 in funding  Fintech and climate accelerator curriculum and startup support services  Mentorship around subjects such as ESG, carbon and energy problem-solving  Exposure to corporates interested in startups dedicated to carbon neutrality and open innovation in the fintech space  A network of fintech and climate tech VC and angel investors   In conversation with Finextra in 2020, McCreary explored how the California-headquartered non-profit has been fostering entrepreneurs with thematic accelerator programmes across the world, while at the same time, supporting the Hewlett Foundation’s five-year climate strategy, running until 2023.  “Fintech has already shown its ability to disrupt the financial system, but what happens if you use fintech with the goal of reducing greenhouse gas emissions specifically,” McCreary stated. It remains to be seen, but it is evident that fintech startups have the potential for substantial impact at scale.  Read New Energy Nexus' report on ‘Climate Fintech: Mapping an Emerging Ecosystem of Climate Capital Catalysts’. ", "source": "Finextra"},
{"category": "retail", "article_link": "/newsarticle/37575/bank-of-ireland-to-close-a-third-of-branch-network", "title": "Bank of Ireland to close a third of branch network", "datetime": "2021-03-01 19:25:03", "image": "/finextra-images/top_pics/xl/bank-of-ireland-3.jpg", "desc": "The Bank of Ireland is to shut a third of its branches as it reaches a digital \"tipping point\" between online and offline transactions.The bank is to shutter 88 outlets in the Republic, reducing its network from 257 to 169, while in Northern Ireland the network will be reduced by 15 from 28 to 13. The move is expected to generate €26 billion in annualised cost savings. Francesca McDonagh, Bank of Ireland CEO, says: For many years, the trend to digital banking has been evident, with customers using branches less and less. Covid-19 has accelerated this changing behaviour, and we’ve seen a seismic shift towards digital banking over the past 12 months. We’ve now reached a tipping point in customer preferences between online and offline banking.\" She says 70% of customers are now digitally active, with a 26% increase in customers registering for the new mobile app since launch. The branch closure programme comes as part of a new three-year strategy to trim costs by €1.5 billion, entailing a reduction in 1400 full time roles achieved through voluntary redundancies. Up to 200 jobs will be impacted by the branch takedowns, which will mostly hit umanned outlets.", "source": "Finextra"},
{"category": "startups", "article_link": "/newsarticle/37581/catalonian-community-bank-attracts-private-investors", "title": "Catalonian community bank attracts private investors", "datetime": "2021-03-02 17:06:04", "image": "/finextra-images/top_pics/xl/catalan.jpg", "desc": "Over 148 private investors have become founding shareholders in a new digital community bank for Catalan people.The new bank offers a mix of digital and traditional relationship banking services, alongside a private social network and B2B marketplace. The startup is building on the strong sense of kinship shared by the Catalonian community, which erupted five years ago in a struggle to secure independence from Spain. Jordi Roset, co-owner of the Petrolis Independents fuel chain, explains his decision to become a founding shareholder: \"I am not investing in the bank like those shareholders who are all day looking at the stock market to see if they made a killing; for me it’s an investment for the future and the country. “Moreover, as a Catalonian I would like to say that we saw many large banks with a long history here, decamp after the independence referendum in 2017. This really shocked all of us. To have a community bank like 11Onze, of which we are founding shareholders, gives me the confidence that it’s here for us and it will stay here for us, for our society and its business fabric.” 11Onze founder James Sène says being digital will not compromise its ambition to offer a personal service. “When banks became digitised, they inevitably became distanced from their customers. Customers are often served by bots or strangers on the end of a phone line. 11Onze brings the local bank experience into a digital world,\" he says. \"Every customer will be connected to a dedicated 11Onze member whom they know by name and background. It’s not merely about going digital, it’s also about keeping it local and intimate.”", "source": "Finextra"}
]